{
  "info": {
    "title": "FedRAMP Machine-Readable Requirements and Recommendations",
    "description": "This datafile contains FedRAMP Requirements and Recommendations (FRR) for cloud service providers seeking FedRAMP Authorization. The FRR outlines the mandatory requirements and best practices that providers must adhere to in order to convey the security of their cloud services within the federal government ecosystem.",
    "version": "0.9.0-beta",
    "last_updated": "2025-01-19"
  },
  "FRR": {
    "ADS": {
      "info": {
        "name": "Authorization Data Sharing",
        "short_name": "ADS",
        "web_name": "authorization-data-sharing",
        "effective": {
          "rev5": {
            "is": "optional",
            "signup_url": "https://docs.google.com/forms/d/e/1FAIpQLSdOH7qeJ9uPlb3zYN35qDPNOm_pXQ8sHanAZIIh5tdgjnubVw/viewform",
            "current_status": "Open Beta",
            "start_date": "2026-02-02",
            "end_date": "2026-05-22",
            "comments": [
              "**Providers MUST notify FedRAMP of intent to participate in the Authorization Data Sharing Rev5 Open Beta by submitting a sign-up form to FedRAMP.**",
              "Rev5 Authorized providers MAY adopt this process beginning February 2, 2026 if they are also participating in the Significant Change Notification and Vulnerability Detection and Response betas.",
              "Providers MUST plan to address all requirements and recommendations in this process by the end of the Open Beta on May 22, 2026.",
              "It is up to providers to coordinate with their active agency customers to ensure agency customers will not be negatively impacted by the provider's participation in this beta."
            ]
          },
          "20x": {
            "is": "required",
            "signup_url": "https://www.fedramp.gov/20x/phase-two/participate/",
            "current_status": "Phase 2 Pilot",
            "start_date": "2025-11-18",
            "end_date": "2026-03-31",
            "comments": [
              "Phase 1 pilot authorizations have one year from authorization to fully address this process but must demonstrate continuous quarterly progress.",
              "Phase 2 Pilot participants must demonstrate significant progress towards addressing this process prior to submission for authorization review."
            ]
          }
        },
        "front_matter": {
          "authority": [
            {
              "reference": "44 USC § 3609 (a)(8)",
              "reference_url": "https://fedramp.gov/docs/authority/law/#a-roles-and-responsibilities",
              "description": "The FedRAMP Authorization Act directs the Administrator of the General Services Administration to \"provide a secure mechanism for storing and sharing necessary data, including FedRAMP authorization packages, to enable better reuse of such packages across agencies, including making available any information and data necessary for agencies...\"",
              "delegation": "This responsibility is delegated to the FedRAMP Director",
              "delegation_url": "https://www.gsa.gov/directives-library/gsa-delegations-of-authority-fedramp"
            },
            {
              "reference": "OMB Memorandum M-24-15 on Modernizing FedRAMP",
              "reference_url": "https://www.fedramp.gov/docs/authority/m-24-15",
              "description": "Section 6 states that \"In general, to encourage both security and agility, Federal agencies should use the same infrastructure relied on by the rest of CSPs' commercial customer base.\""
            }
          ],
          "purpose": "Modern cloud services store and share security and compliance information in convenient repositories that allow customers to rapidly review security information and gain access to additional information as needed. These services often include automated integration with cloud service infrastructure to remove manual burden and ensure information is accurate and up to date.\n\nThis security and compliance information (including FedRAMP authorization data) is the intellectual property of the cloud service provider and is not federal customer data in most cases.* The federal government benefits when the same security information is shared among all customers and even the public to ensure maximum transparency and accountability of cloud service providers.\n\nFedRAMP's Authorization Data Sharing process provides a process or mechanism for cloud service providers to store and share authorization data on their preferred platform of choice if it meets certain FedRAMP requirements.\n\nAt the initial release of this process there will not be many platforms that directly support the requirements in this process. FedRAMP anticipates this will change rapidly in response to market demand as platforms work to provide innovative solutions to these requirements.\n\n* Providers with questions about this should consult with a lawyer who specializes in procurement law. Typically a contract with the government granting ownership of information is required to transfer ownership to the government.",
          "expected_outcomes": [
            "Cloud service providers will be able to manage authorization data in the same platforms used for commercial customers, reusing data as appropriate",
            "Federal agencies will be able to access necessary authorization data via API or other automated mechanisms integrated into agency authorization systems to simplify the burden of review and continuous monitoring",
            "Trust center providers and GRC automation tool providers will develop innovative solutions and improvements to ensure standardized automated data sharing and validation within the FedRAMP ecosystem"
          ]
        },
        "labels": {
          "CSO": {
            "description": "These requirements and recommendations apply to ALL cloud service offerings for FedRAMP Certification or Validation.",
            "name": "Cloud Service Offerings"
          },
          "TRC": {
            "description": "These requirements and recommendations apply to trust centers that are FedRAMP-compatible.",
            "name": "FedRAMP-Compatible Trust Centers"
          }
        }
      },
      "data": {
        "both": {
          "CSO": {
            "ADS-CSO-PUB": {
              "fka": "FRR-ADS-01",
              "statement": "Providers MUST publicly share up-to-date information about the cloud service offering in both human-readable and machine-readable formats, including at least:",
              "affects": ["Providers"],
              "name": "Public Information",
              "primary_key_word": "MUST",
              "following_information": [
                "Direct link to the FedRAMP Marketplace for the offering",
                "Service Model",
                "Deployment Model",
                "Business Category",
                "UEI Number",
                "Contact Information",
                "Overall Service Description",
                "Detailed list of specific services and their impact levels (see FRR-ADS-03)",
                "Summary of customer responsibilities and secure configuration guidance",
                "Process for accessing information in the trust center (if applicable)",
                "Availability status and recent disruptions for the trust center (if applicable)",
                "Customer support information for the trust center (if applicable)"
              ]
            },
            "ADS-CSO-CBF": {
              "fka": "FRR-ADS-02",
              "statement": "Providers MUST use automation to ensure information remains consistent between human-readable and machine-readable formats when authorization data is provided in both formats; Providers SHOULD generate human-readable and machine-readable data from the same source at the same time OR generate human-readable formats directly from machine-readable data.",
              "affects": ["Providers"],
              "name": "Consistency Between Formats",
              "primary_key_word": "MUST"
            },
            "ADS-CSO-DSL": {
              "fka": "FRR-ADS-03",
              "statement": "Providers MUST share a detailed list of specific services and their impact levels that are included in the cloud service offering using clear feature or service names that align with standard public marketing materials; this list MUST be complete enough for a potential customer to determine which services are and are not included in the FedRAMP authorization without requesting access to underlying authorization data.",
              "affects": ["Providers"],
              "name": "Detailed Service List",
              "primary_key_word": "MUST"
            },
            "ADS-CSO-USH": {
              "fka": "FRR-ADS-04",
              "statement": "Providers MUST share authorization data with all necessary parties without interruption, including at least FedRAMP, CISA, and agency customers. ",
              "affects": ["Providers"],
              "name": "Uninterrupted Sharing",
              "primary_key_word": "MUST",
              "note": "\"Without interruption\" means that parties should not have to request manual approval each time they need to access authorization data or go through a complicated process. The preferred way of ensuring access without interruption is to use on-demand just-in-time access provisioning."
            },
            "ADS-CSO-RIS": {
              "fka": "FRR-ADS-05",
              "statement": "Providers MUST provide sufficient information in authorization data to support authorization decisions but SHOULD NOT include sensitive information that would likely enable a threat actor to gain unauthorized access, cause harm, disrupt operations, or otherwise have a negative adverse impact on the cloud service offering. ",
              "affects": ["Providers"],
              "name": "Responsible Information Sharing",
              "primary_key_word": "MUST",
              "note": "This is not a license to exclude accurate risk information, but specifics that would likely lead to compromise should be abstracted. A breach of confidentiality with authorization data should be anticipated by a secure cloud service provider.",
              "examples": [
                {
                  "id": "Examples of unnecessary sensitive information in authorization data",
                  "key_tests": [
                    "Passwords, API keys, access credentials, etc.",
                    "Excessive detail about methodology that exposes weaknesses",
                    "Personally identifiable information about employees"
                  ],
                  "examples": [
                    "DON'T: \"In an emergency, an administrator with physical access to a system can log in using \"secretadmin\" with the password \"pleasewutno\"\" DO: \"In an emergency, administrators with physical access can log in directly.\"",
                    "DON'T: \"All backup MFA credentials are stored in a SuperSafe Series 9000 safe in the CEOs office.\" DO: \"All backup MFA credentials are stored in a UL Class 350 safe in a secure location with limited access.\"",
                    "DON'T: \"During an incident, the incident response team lead by Jim Smith (555-0505) will open a channel at the conference line (555-0101 #97808 passcode 99731)...\" DO: \"During an incident, the incident response team will coordinate over secure channels.\""
                  ]
                }
              ]
            },
            "ADS-CSO-UCP": {
              "fka": "FRR-ADS-06",
              "statement": "Providers of FedRAMP Rev5 Authorized cloud service offerings MUST share authorization data via the USDA Connect Community Portal UNLESS they use a FedRAMP-compatible trust center.",
              "affects": ["Providers"],
              "name": "USDA Connect Community Portal",
              "primary_key_word": "MUST"
            },
            "ADS-CSO-FCT": {
              "fka": "FRR-ADS-07",
              "statement": "Providers of FedRAMP 20x Authorized cloud service offerings MUST use a FedRAMP-compatible trust center to store and share authorization data with all necessary parties.",
              "affects": ["Providers"],
              "name": "FedRAMP-Compatible Trust Centers",
              "primary_key_word": "MUST"
            },
            "ADS-CSO-TCM": {
              "fka": "FRR-ADS-08",
              "statement": "Providers MUST notify all necessary parties when migrating to a trust center and MUST provide information in their existing USDA Connect Community Portal secure folders explaining how to use the trust center to obtain authorization data.",
              "affects": ["Providers"],
              "name": "Trust Center Migration Notification",
              "primary_key_word": "MUST"
            },
            "ADS-CSO-HAD": {
              "fka": "FRR-ADS-09",
              "statement": "Providers MUST make historical versions of authorization data available for three years to all necessary parties UNLESS otherwise specified by applicable FedRAMP requirements; deltas between versions MAY be consolidated quarterly.",
              "affects": ["Providers"],
              "name": "Historical Authorization Data",
              "primary_key_word": "MUST"
            },
            "ADS-CSO-PGD": {
              "fka": "FRR-ADS-AC-01",
              "statement": "Providers MUST publicly provide plain-language policies and guidance for all necessary parties that explains how they can obtain and manage access to authorization data stored in the trust center.",
              "affects": ["Providers"],
              "primary_key_word": "MUST",
              "name": "Public Guidance"
            },
            "ADS-CSO-PCA": {
              "fka": "FRR-ADS-AC-02",
              "statement": "Providers SHOULD share at least the authorization package with prospective agency customers upon request and MUST notify FedRAMP within five business days if a prospective agency customer request is denied.",
              "affects": ["Providers"],
              "name": "Prospective Customer Access",
              "primary_key_word": "SHOULD"
            },
            "ADS-CSO-LSM": {
              "fka": "FRR-ADS-EX-01",
              "statement": "Providers of FedRAMP Rev5 Authorized cloud service offerings at FedRAMP High using a legacy self-managed repository for authorization data MAY ignore the requirements in this Authorization Data Sharing document until future notice.",
              "affects": ["Providers"],
              "name": "Legacy Self-Managed Repository Exception",
              "primary_key_word": "MAY"
            }
          },
          "TRC": {
            "ADS-TRC-TCA": {
              "fka": "FRR-ADS-TC-01",
              "statement": "Trust centers MUST be included as an information resource included in the cloud service offering for assessment if FRR-MAS-01 applies.",
              "affects": ["Providers"],
              "name": "Trust Center Assessment",
              "primary_key_word": "MUST"
            },
            "ADS-TRC-HMR": {
              "fka": "FRR-ADS-TC-02",
              "statement": "Trust centers SHOULD make authorization data available to view and download in both human-readable and machine-readable formats.",
              "affects": ["Providers"],
              "name": "Human and Machine-Readable",
              "primary_key_word": "SHOULD"
            },
            "ADS-TRC-PAC": {
              "fka": "FRR-ADS-TC-03",
              "statement": "Trust centers MUST provide documented programmatic access to all authorization data, including programmatic access to human-readable materials.",
              "affects": ["Providers"],
              "name": "Programmatic Access",
              "primary_key_word": "MUST"
            },
            "ADS-TRC-SSM": {
              "fka": "FRR-ADS-TC-04",
              "statement": "Trust centers SHOULD include features that encourage all necessary parties to provision and manage access to authorization data for their users and services directly.",
              "affects": ["Providers"],
              "name": "Self-Service Access Management",
              "primary_key_word": "SHOULD"
            },
            "ADS-TRC-ACI": {
              "fka": "FRR-ADS-TC-05",
              "statement": "Trust centers MUST maintain an inventory and history of federal agency users or systems with access to authorization data and MUST make this information available to FedRAMP without interruption.",
              "affects": ["Providers"],
              "name": "Access Inventory",
              "primary_key_word": "MUST"
            },
            "ADS-TRC-ACL": {
              "fka": "FRR-ADS-TC-06",
              "statement": "Trust centers MUST log access to authorization data and store summaries of access for at least six months; such information, as it pertains to specific parties, SHOULD be made available upon request by those parties.",
              "affects": ["Providers"],
              "name": "Access Logging",
              "primary_key_word": "MUST"
            },
            "ADS-TRC-RSP": {
              "fka": "FRR-ADS-TC-07",
              "statement": "Trust centers SHOULD deliver responsive performance during normal operating conditions and minimize service disruptions.",
              "affects": ["Providers"],
              "name": "Responsive Performance",
              "primary_key_word": "SHOULD"
            }
          }
        }
      }
    },
    "CCM": {
      "info": {
        "name": "Collaborative Continuous Monitoring",
        "short_name": "CCM",
        "web_name": "collaborative-continuous-monitoring",
        "effective": {
          "rev5": {
            "is": "optional",
            "signup_url": "https://docs.google.com/forms/d/e/1FAIpQLSeFTHtUjXCmAUprCGrMLpgaN2kmL08EluzHvnTzAC4lTCfEVg/viewform",
            "current_status": "Open Beta",
            "start_date": "2026-02-02",
            "end_date": "2026-05-22",
            "comments": [
              "**Providers MUST notify FedRAMP of intent to participate in the Collaborative Continuous Monitoring Rev5 Open Beta by submitting a sign-up form to FedRAMP.**",
              "Rev5 Authorized providers MAY adopt this process beginning February 2, 2026 as part of the Open Beta.",
              "Providers MUST plan to address all requirements and recommendations in this process by the end of the Open Beta on May 22, 2026.",
              "It is up to providers to coordinate with their active agency customers to ensure agency customers will not be negatively impacted by the provider's participation in this beta.",
              "FedRAMP recommends that participants in the Collaborative Continuous Mounting beta also adopt the Vulnerability Detection and Response process and the Significant Change Notifications process."
            ]
          },
          "20x": {
            "is": "required",
            "signup_url": "https://www.fedramp.gov/20x/phase-two/participate/",
            "current_status": "Phase 2 Pilot",
            "start_date": "2025-11-18",
            "end_date": "2026-03-31",
            "comments": [
              "Phase 1 pilot authorizations have one year from authorization to fully address this process but must demonstrate continuous quarterly progress.",
              "Phase 2 Pilot participants must demonstrate significant progress towards addressing this process prior to submission for authorization review."
            ]
          }
        },
        "front_matter": {
          "authority": [
            {
              "reference": "OMB Circular A-130: Managing Information as a Strategic Resource",
              "reference_url": "https://whitehouse.gov/wp-content/uploads/legacydrupalfiles/omb/circulars/A130/a130revised.pdf",
              "description": "section 4 (c) states that agencies SHALL \"conduct and document security and privacy control assessments prior to the operation of an information system, and periodically thereafter, consistent with the frequency defined in the agency information security continuous monitoring (ISCM) and privacy continuous monitoring (PCM) strategies and the agency risk tolerance\""
            },
            {
              "reference": "The FedRAMP Authorization Act (44 USC § 3609 (a)(1))",
              "reference_url": "https://fedramp.gov/docs/authority/law/#a-roles-and-responsibilities",
              "description": "directs the Administrator of the General Services Administration to \"develop, coordinate, and implement a process … including, as appropriate, oversight of continuous monitoring of cloud computing products and services\""
            }
          ],
          "purpose": "Agencies are required to continuously monitor all of their information systems following a documented process integrated into their Information Security Continuous Monitoring (ISCM) strategy. These strategies are specific to each agency and may even vary at the bureau, component, or information system levels.\n\nThe concept behind collaborative continuous monitoring is unique to government customers and creates a burden for commercial cloud service providers. This process attempts to minimize this burden by encouraging the use of automated monitoring and review of authorization data required by other FedRAMP standards and limiting the expected human interaction costs for cloud service providers and agencies. Agencies are expected to use information from the cloud service provider collaboratively in accordance with their agency ISCM strategy without blocking other agencies from making their own risk-based decisions about ongoing authorization.",
          "expected_outcomes": [
            "Cloud service providers will operate their services and share additional information with agency customers to ensure they can meet their responsibilities and obligations for safely and securely operating the service",
            "Federal agencies will have streamlined access to the information they actually need to make ongoing security and authorization decisions while having support from government-wide policies that demonstrate the different responsibilities and obligations for operating cloud services"
          ]
        },
        "labels": {
          "OAR": {
            "description": "These requirements and recommendations for Ongoing Authorization Reports apply to all cloud service offerings following the CCM process.",
            "name": "Ongoing Authorization Reports"
          },
          "QTR": {
            "description": "These requirements and recommendations for Quarterly Reviews apply to all cloud service offerings following the CCM process.",
            "name": "Quarterly Reviews"
          },
          "AGM": {
            "description": "These requirements and recommends for agencies apply to all agencies reusing a FedRAMP Certification or Validation for a cloud service offering following the CCM process.",
            "name": "Agency Requirements and Recommendations"
          }
        }
      },
      "data": {
        "both": {
          "OAR": {
            "CCM-OAR-AVL": {
              "fka": "FRR-CCM-01",
              "statement": "Providers MUST make an Ongoing Authorization Report available to all necessary parties every 3 months, in a consistent format that is human readable, covering the entire period since the previous summary; this report MUST include high-level summaries of at least the following information:",
              "name": "Ongoing Authorization Report Availability",
              "affects": ["Providers"],
              "primary_key_word": "MUST",
              "following_information": [
                "Changes to authorization data",
                "Planned changes to authorization data during at least the next 3 months",
                "Accepted vulnerabilities",
                "Transformative changes",
                "Updated recommendations or best practices for security, configuration, usage, or similar aspects of the cloud service offering"
              ]
            },
            "CCM-OAR-ASR": {
              "fka": "FRR-CCM-02",
              "statement": "Providers SHOULD establish a regular 3 month cycle for Ongoing Authorization Reports that is spread out from the beginning, middle, or end of each quarter.",
              "name": "Avoiding Simultaneous Reports",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD",
              "note": "This recommendation is intended to discourage hundreds of cloud service providers from releasing their Ongoing Authorization Reports during the first or last week of each quarter because that is the easiest way for a single provider to track this deliverable; the result would overwhelm agencies with many cloud services. Widely used cloud service providers are encouraged to work with their customers to identify ideal timeframes for this cycle."
            },
            "CCM-OAR-NRD": {
              "fka": "FRR-CCM-03",
              "statement": "Providers MUST publicly include the target date for their next Ongoing Authorization Report with the authorization data required by FRR-ADS-01.",
              "name": "Public Next Report Date",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "CCM-OAR-FBM": {
              "fka": "FRR-CCM-04",
              "statement": "Providers MUST establish and share an asynchronous mechanism for all necessary parties to provide feedback or ask questions about each Ongoing Authorization Report.",
              "name": "Feedback Mechanism",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "CCM-OAR-AFS": {
              "fka": "FRR-CCM-05",
              "statement": "Providers MUST maintain an anonymized and desensitized summary of the feedback, questions, and answers about each Ongoing Authorization Report as an addendum to the Ongoing Authorization Report.",
              "name": "Anonymized Feedback Summary",
              "affects": ["Providers"],
              "primary_key_word": "MUST",
              "note": "This is intended to encourage sharing of information and decrease the burden on the cloud service provider - providing this summary will reduce duplicate questions from agencies and ensure FedRAMP has access to this information. It is generally in the provider’s interest to update this addendum frequently throughout the quarter."
            },
            "CCM-OAR-PSI": {
              "fka": "FRR-CCM-06",
              "statement": "Providers MUST NOT irresponsibly disclose sensitive information in an Ongoing Authorization Report that would likely have an adverse effect on the cloud service offering.",
              "name": "Protect Sensitive Information",
              "affects": ["Providers"],
              "primary_key_word": "MUST NOT"
            },
            "CCM-OAR-RPS": {
              "fka": "FRR-CCM-07",
              "statement": "Providers MAY responsibly share some or all of the information an Ongoing Authorization Report publicly or with other parties if the provider determines doing so will NOT likely have an adverse effect on the cloud service offering.",
              "name": "Responsible Public Sharing",
              "affects": ["Providers"],
              "primary_key_word": "MAY"
            }
          },
          "QTR": {
            "CCM-QTR-MTG": {
              "fkas": ["FRR-CCM-QR-01", "FRR-CCM-QR-02"],
              "varies_by_level": {
                "low": {
                  "statement": "Providers SHOULD host a synchronous Quarterly Review every 3 months, open to all necessary parties, to review aspects of the most recent Ongoing Authorization Reports that the provider determines are of the most relevance to agencies; providers who do not host Quarterly Reviews MUST clearly state this and explain this decision in the authorization data available to all necessary parties required by FRR-ADS-06 and FRR-ADS-07",
                  "primary_key_word": "SHOULD",
                  "timeframe_type": "months",
                  "timeframe_num": 3
                },
                "moderate": {
                  "statement": "Providers MUST host a synchronous Quarterly Review every 3 months, open to all necessary parties, to review aspects of the most recent Ongoing Authorization Reports that the provider determines are of the most relevance to agencies.",
                  "primary_key_word": "MUST",
                  "timeframe_type": "months",
                  "timeframe_num": 3
                },
                "high": {
                  "statement": "Providers MUST host a synchronous Quarterly Review every 3 months, open to all necessary parties, to review aspects of the most recent Ongoing Authorization Reports that the provider determines are of the most relevance to agencies.",
                  "primary_key_word": "MUST",
                  "timeframe_type": "months",
                  "timeframe_num": 3
                }
              },
              "name": "Quarterly Review Meeting",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "CCM-QTR-RSW": {
              "fka": "FRR-CCM-QR-03",
              "statement": "Providers SHOULD regularly schedule Quarterly Reviews to occur at least 3 business days after releasing an Ongoing Authorization Report AND within 10 business days of such release.",
              "name": "Review Scheduling Window",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            },
            "CCM-QTR-NID": {
              "fka": "FRR-CCM-QR-04",
              "statement": "Providers MUST NOT irresponsibly disclose sensitive information in a Quarterly Review that would likely have an adverse effect on the cloud service offering.",
              "name": "No Irresponsible Disclosure",
              "affects": ["Providers"],
              "primary_key_word": "MUST NOT"
            },
            "CCM-QTR-MRI": {
              "fka": "FRR-CCM-QR-05",
              "statement": "Providers MUST include either a registration link or a downloadable calendar file with meeting information for Quarterly Reviews in the authorization data available to all necessary parties required by FRR-ADS-06 and FRR-ADS-07.",
              "name": "Meeting Registration Info",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "CCM-QTR-NRD": {
              "fka": "FRR-CCM-QR-06",
              "statement": "Providers MUST publicly include the target date for their next Quarterly Review with the authorization data required by FRR-ADS-01.",
              "name": "Next Review Date",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "CCM-QTR-ACT": {
              "fka": "FRR-CCM-QR-07",
              "statement": "Providers SHOULD include additional information in Quarterly Reviews that the provider determines is of interest, use, or otherwise relevant to agencies.",
              "name": "Additional Content",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            },
            "CCM-QTR-RTP": {
              "fka": "FRR-CCM-QR-08",
              "statement": "Providers SHOULD NOT invite third parties to attend Quarterly Reviews intended for agencies unless they have specific relevance.",
              "name": "Restrict Third Parties",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD NOT",
              "note": "This is because agencies are less likely to actively participate in meetings with third parties; the cloud service provider's independent assessor should be considered relevant by default."
            },
            "CCM-QTR-RTR": {
              "fka": "FRR-CCM-QR-09",
              "statement": "Providers SHOULD record or transcribe Quarterly Reviews and make such available to all necessary parties with other authorization data required by FRR-ADS-06 and FRR-ADS07.",
              "name": "Record/Transcribe Reviews",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            },
            "CCM-QTR-SRR": {
              "fka": "FRR-CCM-QR-10",
              "statement": "Providers MAY responsibly share recordings or transcriptions of Quarterly Reviews with the public or other parties ONLY if the provider removes all agency information (comments, questions, names, etc.) AND determines sharing will NOT likely have an adverse effect on the cloud service offering.",
              "name": "Share Recordings Responsibly",
              "affects": ["Providers"],
              "primary_key_word": "MAY"
            },
            "CCM-QTR-SCR": {
              "fka": "FRR-CCM-QR-11",
              "statement": "Providers MAY responsibly share content prepared for a Quarterly Review with the public or other parties if the provider determines doing so will NOT likely have an adverse effect on the cloud service offering.",
              "name": "Share Content Responsibly",
              "affects": ["Providers"],
              "primary_key_word": "MAY"
            }
          },
          "AGM": {
            "CCM-AGM-ROR": {
              "fka": "FRR-CCM-AG-01",
              "statement": "Agencies MUST review each Ongoing Authorization Report to understand how changes to the cloud service offering may impact the previously agreed-upon risk tolerance documented in the agency's Authorization to Operate of a federal information system that includes the cloud service offering in its boundary.",
              "name": "Review Ongoing Reports",
              "affects": ["Agencies"],
              "primary_key_word": "MUST",
              "note": "This is required by 44 USC § 35, OMB A-130, FIPS-200, and M-24-15."
            },
            "CCM-AGM-CSC": {
              "fka": "FRR-CCM-AG-02",
              "statement": "Agencies SHOULD consider the Security Category noted in their Authorization to Operate of the federal information system that includes the cloud service offering in its boundary and assign appropriate information security resources for reviewing Ongoing Authorization Reports, attending Quarterly Reviews, and other ongoing authorization data.",
              "name": "Consider Security Category",
              "affects": ["Agencies"],
              "primary_key_word": "SHOULD"
            },
            "CCM-AGM-SSR": {
              "fka": "FRR-CCM-AG-03",
              "name": "Senior Security Reviewer",
              "varies_by_level": {
                "low": {
                  "statement": "Agencies MAY designate a senior information security official to review Ongoing Authorization Reports and represent the agency at Quarterly Reviews for cloud service offerings included in agency information systems with a Security Category of High.",
                  "primary_key_word": "MAY"
                },
                "moderate": {
                  "statement": "Agencies MAY designate a senior information security official to review Ongoing Authorization Reports and represent the agency at Quarterly Reviews for cloud service offerings included in agency information systems with a Security Category of High.",
                  "primary_key_word": "MAY"
                },
                "high": {
                  "statement": "Agencies SHOULD designate a senior information security official to review Ongoing Authorization Reports and represent the agency at Quarterly Reviews for cloud service offerings included in agency information systems with a Security Category of High.",
                  "primary_key_word": "SHOULD"
                }
              },
              "affects": ["Agencies"]
            },
            "CCM-AGM-NPC": {
              "fka": "FRR-CCM-AG-04",
              "statement": "Agencies SHOULD formally notify the provider if the information presented in an Ongoing Authorization Report, Quarterly Review, or other ongoing authorization data causes significant concerns that may lead the agency to remove the cloud service offering from operation.",
              "name": "Notify Provider of Concerns",
              "affects": ["Agencies"],
              "primary_key_word": "SHOULD"
            },
            "CCM-AGM-NFR": {
              "fka": "FRR-CCM-AG-05",
              "statement": "Agencies MUST notify FedRAMP by sending a notification to info@fedramp.gov if the information presented in an Ongoing Authorization Report, Quarterly Review, or other ongoing authorization data causes significant concerns that may lead the agency to stop operation of the cloud service offering.",
              "name": "Notify FedRAMP of Concerns",
              "affects": ["Agencies"],
              "primary_key_word": "MUST",
              "note": "Agencies are required to notify FedRAMP by OMB Memorandum M-24-15 section IV (a)."
            },
            "CCM-AGM-NAR": {
              "fka": "FRR-CCM-AG-06",
              "statement": "Agencies MUST NOT place additional security requirements on cloud service providers beyond those required by FedRAMP UNLESS the head of the agency or an authorized delegate makes a determination that there is a demonstrable need for such; this does not apply to seeking clarification or asking general questions about authorization data.",
              "name": "No Additional Requirements",
              "affects": ["Agencies"],
              "primary_key_word": "MUST NOT",
              "note": "This is a statutory requirement in 44 USC § 3613 (e) related to the Presumption of Adequacy for a FedRAMP authorization."
            },
            "CCM-AGM-NFA": {
              "fka": "FRR-CCM-AG-07",
              "statement": "Agencies MUST inform FedRAMP after requesting any additional information or materials from a cloud service provider beyond those FedRAMP requires by sending a notification to info@fedramp.gov.",
              "name": "Notify FedRAMP After Requests",
              "affects": ["Agencies"],
              "primary_key_word": "MUST",
              "note": "Agencies are required to notify FedRAMP by OMB Memorandum M-24-15 section IV (a)."
            }
          }
        }
      }
    },
    "FSI": {
      "info": {
        "name": "FedRAMP Security Inbox",
        "short_name": "FSI",
        "web_name": "fedramp-security-inbox",
        "effective": {
          "rev5": {
            "is": "required",
            "signup_url": "",
            "current_status": "Wide Release",
            "start_date": "2026-01-05",
            "end_date": "2027-12-22",
            "comments": [
              "These requirements apply after January 5, 2026, to all FedRAMP Rev5 cloud services that are listed in the FedRAMP Marketplace."
            ],
            "warnings": [
              "**FedRAMP will begin enforcement of this process after January 5, 2026 with an Emergency Test.**",
              "Beginning 2026-03-01, corrective action will include public notification that the provider is not meeting the expectations of this process.",
              "Beginning 2026-05-01, corrective action will include complete removal from the FedRAMP Marketplace.",
              "Beginning 2026-07-01, corrective action will include complete removal from the FedRAMP Marketplace and a ban on FedRAMP authorization for three months."
            ]
          },
          "20x": {
            "is": "required",
            "signup_url": "https://www.fedramp.gov/20x/phase-two/participate/",
            "current_status": "Phase 2 Pilot",
            "start_date": "2025-11-18",
            "end_date": "2026-03-31",
            "comments": [
              "Phase 1 pilot authorizations have one year from authorization to fully address this process but must demonstrate continuous quarterly progress.",
              "Phase 2 Pilot participants must demonstrate significant progress towards addressing this process prior to submission for authorization review."
            ]
          }
        },
        "front_matter": {
          "authority": [
            {
              "reference": "OMB Memorandum M-24-15 on Modernizing FedRAMP",
              "reference_url": "https://www.fedramp.gov/docs/authority/m-24-15",
              "description": "section VII (a) (17) states that GSA must \"position FedRAMP as a central point of contact to the commercial cloud sector for Government-wide communications or requests for risk management information concerning commercial cloud providers used by Federal agencies.\""
            }
          ],
          "purpose": "FedRAMP must have a reliable way to directly contact security and compliance staff operating all FedRAMP Authorized cloud service offerings without tracking individual contacts or maintaining provider-specific logins to customer support portals. These requirements for a FedRAMP Security Inbox apply to all cloud service providers to ensure this direct reliable path remains open, especially in the event of critical security issues.\n\nThis set of requirements focus specifically on communication that comes from FedRAMP and includes three categories of communication:\n\n1. Emergency communications that will only be used during an emergency where response times are critical to protecting the confidentiality, integrity, and availability of federal customer data; this communication path will occasionally be tested by FedRAMP.\n\n2. Important communications that may require an elevated response due to a sensitive or potentially disruptive situation, typically related to ongoing authorization or other concerns.\n\n3. General communications that include all other messages from FedRAMP that may be managed by a cloud service provider following their standard operational process.\n\nAll Emergency and Important messages sent by FedRAMP will include specific actions, timeframes expected for action, and an explanation of the corrective actions that FedRAMP will take if the timeframes are not met. Failure to take timely action as required by Emergency communications will result in corrective action from FedRAMP.\n\nFedRAMP will conduct strictly controlled tests of response to emergency communications regularly and provide public notice of these tests in advance. The response times for these tests will be tracked by FedRAMP and made publicly available.\n\nThis set of requirements and recommendations include explicit requirements that FedRAMP will follow to ensure important communications or those sent during emergencies can be routed by cloud service providers separately from general communications.",
          "expected_outcomes": [
            "FedRAMP will follow a consistent and repeatable process to communicate with cloud service providers, especially when sending important or emergency messages.",
            "Cloud service providers will always receive messages from FedRAMP and prioritize the review and response to important or emergency messages."
          ]
        },
        "labels": {
          "CSO": {
            "description": "These requirements and recommendations apply to all cloud service offerings in the FedRAMP Marketplace.",
            "name": "Cloud Service Offerings"
          },
          "FRP": {
            "description": "These requirements and recommendations apply to FedRAMP when communicating with cloud service offerings in the FedRAMP Marketplace.",
            "name": "FedRAMP"
          }
        }
      },
      "data": {
        "both": {
          "FRP": {
            "FSI-FRP-VRE": {
              "fka": "FRR-FSI-01",
              "statement": "FedRAMP MUST send messages to cloud service providers using an official @fedramp.gov or @gsa.gov email address with properly configured Sender Policy Framework (SPF), DomainKeys Identified Mail (DKIM), and Domain-based Message Authentication Reporting and Conformance (DMARC) email authentication.",
              "name": "Verified Emails",
              "affects": ["FedRAMP"],
              "note": "Anyone at GSA can send email from @fedramp.gov or @gsa.gov - FedRAMP team members will typically have \"FedRAMP\" or \"Q20B\" in their name but this is not universal or enforceable. The nature of government enterprise IT services makes it difficult for FedRAMP to isolate FedRAMP-specific team members with enforceable identifiers.",
              "primary_key_word": "MUST"
            },
            "FSI-FRP-CDS": {
              "fka": "FRR-FSI-02",
              "statement": "FedRAMP MUST convey the criticality of the message in the subject line using one of the following designators if the message requires an elevated response:",
              "name": "Criticality Designators",
              "affects": ["FedRAMP"],
              "primary_key_word": "MUST",
              "following_information": [
                "**Emergency:** There is a potential incident or crisis such that FedRAMP requires an extremely urgent response; emergency messages will contain aggressive timeframes for response and failure to meet these timeframes will result in corrective action.",
                "**Emergency Test:** FedRAMP requires an extremely urgent response to confirm the functionality and effectiveness of the FedRAMP Security Inbox; emergency test messages will contain aggressive timeframes for response and failure to meet these timeframes will result in corrective action.",
                "**Important:** There is an important issue that FedRAMP requires the cloud service provider to address; important messages will contain reasonable timeframes for response and failure to meet these timeframes may result in corrective action."
              ],
              "note": "Messages sent by FedRAMP without one of these designators are considered general communications and do not require an elevated response; these may be resolved in the normal course of business by the cloud service provider."
            },
            "FSI-FRP-SND": {
              "fka": "FRR-FSI-03",
              "statement": "FedRAMP MUST send Emergency and Emergency Test designated messages from fedramp_security@gsa.gov OR fedramp_security@fedramp.gov.",
              "name": "Sender Addresses",
              "affects": ["FedRAMP"],
              "primary_key_word": "MUST"
            },
            "FSI-FRP-PNT": {
              "fka": "FRR-FSI-04",
              "statement": "FedRAMP MUST post a public notice at least 10 business days in advance of sending an Emergency Test message; such notices MUST include explanation of the likely expected actions and timeframes for the Emergency Test message.",
              "name": "Public Notice of Emergency Tests",
              "affects": ["FedRAMP"],
              "primary_key_word": "MUST"
            },
            "FSI-FRP-RQA": {
              "fka": "FRR-FSI-05",
              "statement": "FedRAMP MUST clearly specify the required actions in the body of messages that require an elevated response.",
              "name": "Required Actions",
              "affects": ["FedRAMP"],
              "primary_key_word": "MUST"
            },
            "FSI-FRP-RSP": {
              "fka": "FRR-FSI-06",
              "statement": "FedRAMP MUST clearly specify the expected timeframe for completing required actions in the body of messages that require an elevated response; timeframes for actions will vary depending on the situation but the default timeframes to provide an estimated resolution time for Emergency and Emergency Test designated messages will be as follows:",
              "name": "Response Timeframes",
              "affects": ["FedRAMP"],
              "primary_key_word": "MUST",
              "following_information": [
                "**High Impact:** within 12 hours",
                "**Moderate Impact:** by 3:00 p.m. Eastern Time on the 2nd business day",
                "**Low Impact:** by 3:00 p.m. Eastern Time on the 3rd business day"
              ],
              "note": "High impact cloud service providers are expected to address Emergency messages (including tests) from FedRAMP with a response time appropriate to operating a service where failure to respond rapidly might have a severe or catastrophic adverse effect on the U.S. Government; some Emergency messages may require faster responses and all such messages should be addressed as quickly as possible."
            },
            "FSI-FRP-COR": {
              "fka": "FRR-FSI-07",
              "statement": "FedRAMP MUST clearly specify the corrective actions that will result from failure to complete the required actions in the body of messages that require an elevated response; such actions may vary from negative ratings in the FedRAMP Marketplace to suspension of FedRAMP authorization depending on the severity of the event.",
              "name": "Corrective Actions",
              "affects": ["FedRAMP"],
              "primary_key_word": "MUST"
            },
            "FSI-FRP-RPM": {
              "fka": "FRR-FSI-08",
              "statement": "FedRAMP MAY track and publicly share the time required by cloud service providers to take the actions specified in messages that require an elevated response.",
              "name": "Response Metrics",
              "affects": ["FedRAMP"],
              "primary_key_word": "MAY"
            }
          },
          "CSO": {
            "FSI-CSO-INB": {
              "fka": "FRR-FSI-09",
              "statement": "Providers MUST establish and maintain an email address to receive messages from FedRAMP; this inbox is a FedRAMP Security Inbox (FSI).",
              "name": "FedRAMP Security Inbox",
              "affects": ["Providers"],
              "primary_key_word": "MUST",
              "notes": [
                "Unless otherwise notified, FedRAMP will use the listed Security E-mail on the Marketplace for these notifications.",
                "If a provider establishes a new inbox in response to this guidance that is different from the Security E-Mail then they must follow the requirements in FRR-FSI-12 to notify FedRAMP."
              ]
            },
            "FSI-CSO-RCV": {
              "fka": "FRR-FSI-10",
              "statement": "Providers MUST treat any email originating from an @fedramp.gov or @gsa.gov email address as if it was sent from FedRAMP by default; if such a message is confirmed to originate from someone other than FedRAMP then FedRAMP Security Inbox requirements no longer apply.",
              "name": "Receiving Messages",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "FSI-CSO-RSP": {
              "fka": "FRR-FSI-11",
              "statement": "Providers MUST receive and respond to email messages from FedRAMP without disruption and without requiring additional actions from FedRAMP.",
              "name": "Response Required",
              "affects": ["Providers"],
              "primary_key_word": "MUST",
              "note": "This requirement is intended to prevent cloud service providers from requiring FedRAMP to respond to a CAPTCHA, log into a customer portal, or otherwise take service-specific actions that might prevent the security team from receiving the message."
            },
            "FSI-CSO-NOC": {
              "fka": "FRR-FSI-12",
              "statement": "Providers MUST immediately notify FedRAMP of any changes in addressing for their FedRAMP Security Inbox by emailing info@fedramp.gov with the name and FedRAMP ID of the cloud service offering and the updated email address.",
              "name": "Notification of Changes",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "FSI-CSO-ACK": {
              "fka": "FRR-FSI-13",
              "statement": "Providers SHOULD promptly and automatically acknowledge the receipt of messages received from FedRAMP in their FedRAMP Security Inbox.",
              "name": "Acknowledgment of Receipt",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            },
            "FSI-CSO-EMR": {
              "fka": "FRR-FSI-14",
              "statement": "Providers MUST complete the required actions in Emergency or Emergency Test designated messages sent by FedRAMP within the timeframe included in the message.",
              "name": "Required Response for Emergency Messages",
              "affects": ["Providers"],
              "primary_key_word": "MUST",
              "note": "Timeframes may vary by impact level of the cloud service offering."
            },
            "FSI-CSO-SNR": {
              "fka": "FRR-FSI-15",
              "statement": "Providers MUST route Emergency designated messages sent by FedRAMP to a senior security official for their awareness.",
              "name": "Senior Officials",
              "affects": ["Providers"],
              "primary_key_word": "MUST",
              "note": "Senior security officials are determined by the provider."
            },
            "FSI-CSO-IMP": {
              "fka": "FRR-FSI-16",
              "statement": "Providers SHOULD complete the required actions in Important designated messages sent by FedRAMP within the timeframe specified in the message.",
              "name": "Recommended Response for Important Messages",
              "note": "Timeframes may vary by impact level of the cloud service offering.",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            }
          }
        }
      }
    },
    "ICP": {
      "info": {
        "name": "Incident Communications Procedures",
        "short_name": "ICP",
        "web_name": "incident-communications-procedures",
        "effective": {
          "rev5": {
            "is": "no"
          },
          "20x": {
            "is": "required",
            "signup_url": "https://www.fedramp.gov/20x/phase-two/participate/",
            "current_status": "Phase 2 Pilot",
            "start_date": "2025-11-18",
            "end_date": "2026-03-31",
            "comments": [
              "Phase 1 pilot authorizations have one year from authorization to fully address this process but must demonstrate continuous quarterly progress.",
              "Phase 2 Pilot participants must demonstrate significant progress towards addressing this process prior to submission for authorization review."
            ]
          }
        },
        "front_matter": {
          "purpose": "This set of requirements and recommendations converts the existing FedRAMP Incident Communications Procedures (https://www.fedramp.gov/docs/rev5/csp/continuous-monitoring/intro) to the simpler FedRAMP 20x style and clarifies the expectations for FedRAMP 20x.\n\nThe only notable change from the default Rev5 Incident Communications Procedures for 20x is the addition of a recommendation that incident information be made available in both human-readable and machine-readable formats."
        },
        "labels": {
          "CSO": {
            "description": "These requirements and recommendations apply to all FedRAMP 20x Validated cloud service offerings.",
            "name": "Cloud Service Offerings"
          }
        }
      },
      "data": {
        "20x": {
          "CSO": {
            "ICP-CSO-IRF": {
              "fka": "FRR-ICP-01",
              "statement": "Providers MUST responsibly report incidents to FedRAMP within 1 hour of identification by sending an email to fedramp_security@fedramp.gov or fedramp_security@gsa.gov.",
              "name": "Incident Reporting to FedRAMP",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "ICP-CSO-IRA": {
              "fka": "FRR-ICP-02",
              "statement": "Providers MUST responsibly report incidents to all agency customers within 1 hour of identification using the incident communications points of contact provided by each agency customer.",
              "name": "Incident Reporting to Agencies",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "ICP-CSO-IRC": {
              "fka": "FRR-ICP-03",
              "statement": "Providers MUST responsibly report incidents to CISA within 1 hour of identification if the incident is confirmed or suspected to be the result of an attack vector listed at https://www.cisa.gov/federal-incident-notification-guidelines#attack-vectors-taxonomy, following the CISA Federal Incident Notification Guidelines at https://www.cisa.gov/federal-incident-notification-guidelines, by using the CISA Incident Reporting System at https://myservices.cisa.gov/irf. ",
              "name": "Incident Reporting to CISA",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "ICP-CSO-ICU": {
              "fka": "FRR-ICP-04",
              "statement": "Providers MUST update all necessary parties, including at least FedRAMP, CISA (if applicable), and all agency customers, at least once per calendar day until the incident is resolved and recovery is complete.",
              "name": "Incident Updates",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "ICP-CSO-RPT": {
              "fka": "FRR-ICP-05",
              "statement": "Providers MUST make incident report information available in their secure FedRAMP repository (such as USDA Connect) or trust center.",
              "name": "Incident Report Availability",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "ICP-CSO-RSD": {
              "fka": "FRR-ICP-06",
              "statement": "Providers MUST NOT irresponsibly disclose specific sensitive information about incidents that would likely increase the impact of the incident, but MUST disclose sufficient information for informed risk-based decision-making to all necessary parties.",
              "name": "Responsible Disclosure",
              "affects": ["Providers"],
              "primary_key_word": "MUST NOT"
            },
            "ICP-CSO-FIR": {
              "fka": "FRR-ICP-07",
              "statement": "Providers MUST provide a final report once the incident is resolved and recovery is complete that describes at least:",
              "name": "Final Incident Report",
              "affects": ["Providers"],
              "primary_key_word": "MUST",
              "following_information": [
                "What occurred",
                "Root cause",
                "Response",
                "Lessons learned",
                "Changes needed"
              ]
            },
            "ICP-CSO-AUR": {
              "fka": "FRR-ICP-08",
              "statement": "Providers SHOULD use automated mechanisms for reporting incidents and providing updates to all necessary parties (including CISA).",
              "name": "Automated Reporting",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            },
            "ICP-CSO-HRM": {
              "fka": "FRR-ICP-09",
              "statement": "Providers SHOULD make incident report information available in consistent human-readable and machine-readable formats.",
              "name": "Human-Readable and Machine-Readable Formats",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            }
          }
        }
      }
    },
    "MAS": {
      "info": {
        "name": "Minimum Assessment Scope",
        "short_name": "MAS",
        "web_name": "minimum-assessment-scope",
        "effective": {
          "rev5": {
            "is": "optional",
            "signup_url": "",
            "current_status": "Wide Release",
            "start_date": "2026-01-12",
            "end_date": "2027-12-22",
            "comments": [
              "Rev5 Authorized providers or those seeking FedRAMP authorization MAY adopt this process in place of the traditional FedRAMP boundary after January 12, 2026.",
              "Providers MUST follow the Significant Change Request process (or Significant Change Notification if applicable) to transition from the traditional boundary to the MAS, and this change must be assessed by a FedRAMP recognized assessor.",
              "Providers adopting this process MUST comply with ALL requirements and recommendations, including documentation. Templates are not provided for Rev5 MAS adoption so it is up to the provider to minimize confusion.",
              "Rev5 Authorized providers who switch from a traditional FedRAMP boundary to the MAS MUST notify FedRAMP by sending an email to info@fedramp.gov.",
              "All new Rev5 authorizations in progress that use the MAS must clearly mark all authorization data to indicate adoption of the MAS.",
              "The FedRAMP Marketplace will include a section that indicates if a cloud service offering is following this process."
            ]
          },
          "20x": {
            "is": "required",
            "signup_url": "https://www.fedramp.gov/20x/phase-two/participate/",
            "current_status": "Phase 2 Pilot",
            "start_date": "2025-11-18",
            "end_date": "2026-03-31",
            "comments": [
              "Phase 1 pilot authorizations have one year from authorization to fully address this process but must demonstrate continuous quarterly progress.",
              "Phase 2 Pilot participants must demonstrate significant progress towards addressing this process prior to submission for authorization review."
            ]
          }
        },
        "front_matter": {
          "authority": [
            {
              "reference": "OMB Circular A-130: Managing Information as a Strategic Resource",
              "reference_url": "https://whitehouse.gov/wp-content/uploads/legacydrupalfiles/omb/circulars/A130/a130revised.pdf",
              "description": "Section 10 states that an \"Authorization boundary\" includes \"all components of an information system to be authorized for operation by an authorizing official. This excludes separately authorized systems to which the information system is connected.\" and further adds in footnote 64 that \"Agencies have significant flexibility in determining what constitutes an information system and its associated boundary.\""
            },
            {
              "reference": "NIST SP 800-37 Rev. 2",
              "reference_url": "https://csrc.nist.gov/pubs/sp/800/37/r2/final",
              "description": "Chapter 2.4 footnote 36 similarly states that \"the term authorization boundary is now used exclusively to refer to the set of system elements comprising the system to be authorized for operation or authorized for use by an authorizing official (i.e., the scope of the authorization).\""
            },
            {
              "reference": "FedRAMP Authorization Act (44 USC § 3609 (a) (4))",
              "reference_url": "https://fedramp.gov/docs/authority/law/#a-roles-and-responsibilities",
              "description": "Requires the General Services Administration to \"establish and update guidance on the boundaries of FedRAMP authorization packages to enhance the security and protection of Federal information and promote transparency for agencies and users as to which services are included in the scope of a FedRAMP authorization.\"",
              "delegation": "This responsibility is delegated to the FedRAMP Director",
              "delegation_url": "https://www.gsa.gov/directives-library/gsa-delegations-of-authority-fedramp"
            }
          ],
          "purpose": "Application boundaries that are defined too broadly complicate the assessment process by introducing components that are unlikely to have an impact on the confidentiality, integrity or accessibility of the offering. The Minimum Assessment Scope provides guidance for cloud service providers to narrowly define information resource boundaries while still including all necessary components.",
          "expected_outcomes": [
            "Boundaries will include the minimum number of components to make authorization and assessment easier",
            "Cloud service providers will define clear boundaries for security and assessment of offerings based on the direct risk to federal customer data",
            "Third-party independent assessors will have a simple well documented approach to assess security and implementation decisions",
            "Federal agencies will be able to easily, quickly, and effectively review and consume security information about the service to make informed risk-based Authorization to Operate decisions based on their planned use case"
          ]
        },
        "labels": {
          "CSO": {
            "description": "These requirements and recommendations apply to all cloud service offerings following the Minimum Assessment Scope process.",
            "name": "Cloud Service Offerings"
          }
        }
      },
      "data": {
        "both": {
          "CSO": {
            "MAS-CSO-CSO": {
              "fka": "FRR-MAS-01",
              "statement": "Providers MUST identify a set of information resources to assess for FedRAMP authorization that includes all information resources that are likely to handle federal customer data or likely to impact the confidentiality, integrity, or availability of federal customer data handled by the cloud service offering.",
              "affects": ["Providers"],
              "name": "Cloud Service Offering Identification",
              "primary_key_word": "MUST",
              "notes": [
                "Certain categories of cloud computing products and services are specified as entirely outside the scope of FedRAMP by the Director of the Office of Management and Budget. All such products and services are therefore not included in the cloud service offering for FedRAMP. For more, see https://fedramp.gov/scope.",
                "Software produced by cloud service providers that is delivered separately for installation on agency systems and not operated in a shared responsibility model (typically including agents, application clients, mobile applications, etc. that are not fully managed by the cloud service provider) is not a cloud computing product or service and is entirely outside the scope of FedRAMP under the FedRAMP Authorization Act. All such software is therefore not included in the cloud service offering for FedRAMP. For more, see fedramp.gov/scope.",
                "All aspects of the cloud service offering are determined and maintained by the cloud service provider in accordance with related FedRAMP authorization requirements and documented by the cloud service provider in their assessment and authorization materials."
              ]
            },
            "MAS-CSO-TPR": {
              "fka": "FRR-MAS-02",
              "statement": "Providers MUST include the configuration and usage of third-party information resources, ONLY IF FRR-MAS-01 APPLIES.",
              "affects": ["Providers"],
              "name": "Third-Party Information Resources",
              "primary_key_word": "MUST",
              "note": "Information resources (including third-party information resources) that do not meet the conditions in FRR-MAS-01 are not included in the cloud service offering for FedRAMP (FRR-MAS-02)."
            },
            "MAS-CSO-NFR": {
              "fka": "FRR-MAS-03",
              "statement": "Providers MUST clearly identify and document the justification, mitigation measures, compensating controls, and potential impact to federal customer data from the configuration and usage of non-FedRAMP authorized third-party information resources, ONLY IF FRR-MAS-01 APPLIES.",
              "affects": ["Providers"],
              "name": "Non-FedRAMP Authorized Third-Party Information Resources",
              "primary_key_word": "MUST"
            },
            "MAS-CSO-MDI": {
              "fka": "FRR-MAS-04",
              "statement": "Providers MUST include metadata (including metadata about federal customer data), ONLY IF FRR-MAS-01 APPLIES.",
              "affects": ["Providers"],
              "name": "Metadata Inclusion",
              "primary_key_word": "MUST"
            },
            "MAS-CSO-FLO": {
              "fka": "FRR-MAS-05",
              "statement": "Providers MUST clearly identify, document, and explain information flows and impact levels for ALL information resources, ONLY IF FRR-MAS-01 APPLIES.",
              "affects": ["Providers"],
              "name": "Information Flows and Impact Levels",
              "primary_key_word": "MUST",
              "note": "Information resources (including third-party information resources) MAY vary by impact level as appropriate to the level of information handled or impacted by the information resource (FRR-MAS-05)."
            },
            "MAS-CSO-SUP": {
              "fka": "FRR-MAS-EX-01",
              "statement": "Providers MAY include documentation of information resources beyond the cloud service offering, or even entirely outside the scope of FedRAMP, in a FedRAMP assessment and authorization package supplement; these resources will not be FedRAMP authorized and MUST be clearly marked and separated from the cloud service offering.",
              "affects": ["Providers"],
              "name": "Supplemental Information",
              "primary_key_word": "MAY"
            }
          }
        }
      }
    },
    "PVA": {
      "info": {
        "name": "Persistent Validation and Assessment",
        "short_name": "PVA",
        "web_name": "persistent-validation-and-assessment",
        "effective": {
          "rev5": {
            "is": "no"
          },
          "20x": {
            "is": "required",
            "signup_url": "https://www.fedramp.gov/20x/phase-two/participate/",
            "current_status": "Phase 2 Pilot",
            "start_date": "2025-11-18",
            "end_date": "2026-03-31",
            "comments": [
              "Phase 1 pilot authorizations have one year from authorization to fully address this process but must demonstrate continuous quarterly progress.",
              "Phase 2 Pilot participants must demonstrate significant progress towards addressing this process prior to submission for authorization review."
            ]
          }
        },
        "front_matter": {
          "authority": [
            {
              "reference": "OMB Circular A-130: Managing Information as a Strategic Resource",
              "reference_url": "https://whitehouse.gov/wp-content/uploads/legacydrupalfiles/omb/circulars/A130/a130revised.pdf",
              "description": "defines continuous monitoring as \"maintaining ongoing awareness of information security, vulnerabilities, threats, and incidents to support agency risk management decisions.\""
            },
            {
              "reference": "The FedRAMP Authorization Act (44 USC § 3609 (a) (7))",
              "reference_url": "https://fedramp.gov/docs/authority/law/#a-roles-and-responsibilities",
              "description": "directs the Administrator of the General Services Administration to \"coordinate with the FedRAMP Board, the Director of the Cybersecurity and Infrastructure Security Agency, and other entities identified by the Administrator, with the concurrence of the Director and the Secretary, to establish and regularly update a framework for continuous monitoring...\""
            }
          ],
          "purpose": "FedRAMP 20x is built around the core concept that secure cloud service providers will persistently and automatically validate that their security decisions and policies are being implemented as expected within their cloud service offering. The activities of a secure service should be intentional, documented, and in a state that is always known and understood by the provider.\n\nSecure providers will design their business processes and technical procedures to maximize the use of automation, persistent validation, and reporting across the entirety of their cloud service offering. This reduces cost by increasing efficiency, enables fast agile delivery of new capabilities and prevents unintended drift between the deployed cloud service offering and the business goals for the offering. Secure providers leverage automated and independent audits to evaluate the validity and effectiveness of their secure practices.\n\nAll FedRAMP 20x Authorized providers are expected to implement persistent validation programs as part of their core engineering workflow. These programs should be optimized to deliver value to the provider and their engineering teams first and foremost, though agencies and other customers will benefit from the improved security and insight resulting from high quality persistent validation programs.\n\nTo obtain and maintain a FedRAMP 20x authorization, providers will be required to have their persistent validation programs assessed regularly for effectiveness and completeness.",
          "expected_outcomes": [
            "Cloud service providers will operate effective persistent validation programs to always understand the state of their services.",
            "Assessors will prioritize technical review of validation programs to ensure the quality and effectiveness of a cloud service provider’s security programs are documented accurately.",
            "Federal agencies will have significantly increased confidence in the quality and effectiveness of cloud service provider’s security programs."
          ]
        },
        "labels": {
          "CSO": {
            "description": "These requirements and recommendations apply to all FedRAMP Validated cloud service offerings.",
            "name": "Cloud Service Offerings"
          },
          "TPO": {
            "description": "These requirements and recommendations apply to all assessors performing verification and validation for FedRAMP Validated cloud service offerings.",
            "name": "Assessors"
          }
        },
        "data": {
          "20x": {
            "CSO": {
              "PVA-CSO-VAL": {
                "fka": "FRR-PVA-01",
                "name": "Persistent Validation",
                "statement": "Providers MUST persistently perform validation of their Key Security Indicators following the processes and cycles documented for their cloud service offering per FRR-KSI-02; this process is called persistent validation and is part of vulnerability detection.",
                "affects": ["Providers"],
                "primary_key_word": "MUST"
              },
              "PVA-CSO-FAV": {
                "fka": "FRR-PVA-02",
                "name": "Failures As Vulnerabilities",
                "statement": "Providers MUST treat failures detected during persistent validation and failures of the persistent validation process as vulnerabilities, then follow the requirements and recommendations in the FedRAMP Vulnerability Detection and Response process for such findings.",
                "affects": ["Providers"],
                "primary_key_word": "MUST"
              },
              "PVA-CSO-RPV": {
                "fka": "FRR-PVA-03",
                "statement": "Providers MUST include persistent validation activity in the reports on vulnerability detection and response activity required by the FedRAMP Vulnerability Detection and Response process.",
                "name": "Report Persistent Validation",
                "affects": ["Providers"],
                "primary_key_word": "MUST"
              },
              "PVA-CSO-TSC": {
                "fka": "FRR-PVA-04",
                "name": "Track Significant Changes",
                "statement": "Providers MUST track significant changes that impact their Key Security Indicator goals and validation processes while following the requirements and recommendations in the FedRAMP Significant Change Notification process; if such significant changes are not properly tracked and supplied to all necessary assessors then a full Initial FedRAMP Assessment may be required in place of the expected Persistent FedRAMP Assessment.",
                "affects": ["Providers"],
                "primary_key_word": "MUST"
              },
              "PVA-CSO-IVV": {
                "fka": "FRR-PVA-05",
                "name": "Independent Verification and Validation",
                "statement": "Providers MUST have the implementation of their goals and validation processes assessed by a FedRAMP-recognized independent assessor OR by FedRAMP directly AND MUST include the results of this assessment in their authorization data without modification.",
                "affects": ["Providers"],
                "primary_key_word": "MUST",
                "notes": [
                  "The option for assessment by FedRAMP directly is limited to cloud services that are explicitly prioritized by FedRAMP, in consultation with the FedRAMP Board and the federal Chief Information Officers Council. During 20x Phase Two this includes AI services that meet certain criteria as shown at https://fedramp.gov/ai.",
                  "FedRAMP recognized assessors are listed on the FedRAMP Marketplace."
                ]
              },
              "PVA-CSO-CVA": {
                "fka": "FRR-PVA-06",
                "name": "Complete Validation Assessment",
                "statement": "Providers MUST ensure a complete assessment of validation procedures (including underlying code, pipelines, configurations, automation tools, etc.) for the cloud service offering by all necessary assessors.",
                "affects": ["Providers"],
                "primary_key_word": "MUST",
                "note": ""
              },
              "PVA-CSO-PTE": {
                "fka": "FRR-PVA-07",
                "name": "Provide Technical Evidence",
                "statement": "Providers SHOULD provide technical explanations, demonstrations, and other relevant supporting information to all necessary assessors for the technical capabilities they employ to meet Key Security Indicators and to provide validation.",
                "affects": ["Providers"],
                "primary_key_word": "SHOULD"
              },
              "PVA-CSO-RIV": {
                "fka": "FRR-PVA-08",
                "name": "Receiving Independent Advice",
                "statement": "Providers MAY ask for and accept advice from their assessor during assessment regarding techniques and procedures that will improve their security posture or the effectiveness, clarity, and accuracy of their validation and reporting procedures for Key Security Indicators, UNLESS doing so might compromise the objectivity and integrity of the assessment (see also FRR-PVA-09).",
                "affects": ["Providers"],
                "primary_key_word": "MAY",
                "note": "The related A2LA requirements are waived for FedRAMP 20x Phase Two assessments."
              },
              "PVA-CSO-NMV": {
                "fkas": ["FRR-PVA-TF-LO-01", "FRR-PVA-TF-MO-01"],
                "statement": "Providers MUST complete the validation processes for Key Security Indicators of non-machine-based information resources at least once every 3 months.",
                "name": "Non-Machine Validation",
                "affects": ["Providers"],
                "primary_key_word": "MUST"
              },
              "PVA-CSO-PMV": {
                "fkas": ["FRR-PVA-TF-LO-02", "FRR-PVA-TF-MO-02"],
                "varies_by_level": {
                  "low": {
                    "statement": "Providers MUST complete the validation processes for Key Security Indicators of machine-based information resources at least once every 7 days.",
                    "primary_key_word": "MUST",
                    "timeframe_type": "days",
                    "timeframe_num": 7
                  },
                  "moderate": {
                    "statement": "Providers MUST complete the validation processes for Key Security Indicators of machine-based information resources at least once every 3 days.",
                    "primary_key_word": "MUST",
                    "timeframe_type": "days",
                    "timeframe_num": 3
                  },
                  "high": {
                    "statement": "Providers SHOULD plan for this requirement to be more frequent at 20x High but the anticipated requirements for this FRR have not yet been established for 20x High.",
                    "primary_key_word": "SHOULD"
                  }
                },
                "name": "Persistent Machine Validation",
                "affects": ["Providers"]
              }
            },
            "TPO": {
              "PVA-TPO-AMA": {
                "fka": "FRR-PVA-09",
                "name": "Assessors May Advise",
                "statement": "Assessors MAY share advice with providers they are assessing about techniques and procedures that will improve their security posture or the effectiveness, clarity, and accuracy of their validation and reporting procedures for Key Security Indicators, UNLESS doing so might compromise the objectivity and integrity of the assessment (see also FRR-PVA-08).",
                "affects": ["Assessors"],
                "primary_key_word": "MAY"
              },
              "PVA-TPO-EVP": {
                "fka": "FRR-PVA-10",
                "name": "Evaluate Validation Processes",
                "statement": "Assessors MUST evaluate the underlying processes (both machine-based and non-machine-based) that providers use to validate Key Security Indicators; this evaluation should include at least:",
                "affects": ["Assessors"],
                "primary_key_word": "MUST",
                "following_information": [
                  "The effectiveness, completeness, and integrity of the automated processes that perform validation of the cloud service offering's security posture.",
                  "The effectiveness, completeness, and integrity of the human processes that perform validation of the cloud service offering's security posture",
                  "The coverage of these processes within the cloud service offering, including if all of the consolidated information resources listed are being validated."
                ]
              },
              "PVA-TPO-API": {
                "fka": "FRR-PVA-11",
                "name": "Assess Process Implementation",
                "statement": "Assessors MUST evaluate the implementation of processes derived from Key Security Indicators to determine whether or not the provider has accurately documented their process and goals.",
                "affects": ["Assessors"],
                "primary_key_word": "MUST"
              },
              "PVA-TPO-AOC": {
                "fka": "FRR-PVA-12",
                "name": "Assess Outcome Consistency",
                "statement": "Assessors MUST evaluate whether or not the underlying processes are consistently creating the desired security outcome documented by the provider.",
                "affects": ["Assessors"],
                "primary_key_word": "MUST"
              },
              "PVA-TPO-MME": {
                "fka": "FRR-PVA-13",
                "name": "Mixed Methods Evaluation",
                "statement": "Assessors MUST perform evaluation using a combination of quantitative and expert qualitative assessment as appropriate AND document which is applied to which aspect of the assessment.",
                "affects": ["Assessors"],
                "primary_key_word": "MUST"
              },
              "PVA-TPO-EPE": {
                "fka": "FRR-PVA-14",
                "name": "Engage Provider Experts",
                "statement": "Assessors SHOULD engage provider experts in discussion to understand the decisions made by the provider and inform expert qualitative assessment, and SHOULD perform independent research to test such information as part of the expert qualitative assessment process.",
                "affects": ["Assessors"],
                "primary_key_word": "SHOULD"
              },
              "PVA-TPO-ASE": {
                "fka": "FRR-PVA-15",
                "name": "Avoid Static Evidence",
                "statement": "Assessors MUST NOT rely on screenshots, configuration dumps, or other static output as evidence EXCEPT when evaluating the accuracy and reliability of a process that generates such artifacts.",
                "affects": ["Assessors"],
                "primary_key_word": "MUST NOT"
              },
              "PVA-TPO-VPA": {
                "fka": "FRR-PVA-16",
                "name": "Verify Procedure Adherence",
                "statement": "Assessors MUST assess whether or not procedures are consistently followed, including the processes in place to ensure this occurs, without relying solely on the existence of a procedure document for assessing if appropriate processes and procedures are in place.",
                "note": "This includes evaluating tests or plans for activities that may occur in the future but have not yet occurred.",
                "affects": ["Assessors"],
                "primary_key_word": "MUST"
              },
              "PVA-TPO-SUM": {
                "fka": "FRR-PVA-17",
                "name": "Deliver Assessment Summary",
                "statement": "Assessors MUST deliver a high-level summary of their assessment process and findings for each Key Security Indicator; this summary will be included in the authorization data for the cloud service offering.",
                "affects": ["Assessors"],
                "primary_key_word": "MUST"
              },
              "PVA-TPO-NOR": {
                "fka": "FRR-PVA-18",
                "name": "No Overall Recommendation",
                "statement": "Assessors MUST NOT deliver an overall recommendation on whether or not the cloud service offering meets the requirements for FedRAMP authorization.",
                "affects": ["Assessors"],
                "primary_key_word": "MUST NOT",
                "note": "FedRAMP will make the final authorization decision based on the assessor's findings and other relevant information."
              }
            }
          }
        }
      }
    },
    "RSC": {
      "info": {
        "name": "Recommended Secure Configuration",
        "short_name": "RSC",
        "web_name": "recommended-secure-configuration",
        "effective": {
          "rev5": {
            "is": "required",
            "signup_url": "",
            "current_status": "Wide Release",
            "start_date": "2026-03-01",
            "end_date": "2027-12-22",
            "comments": [
              "These requirements apply after March 1, 2026, to all FedRAMP Rev5 cloud services that are listed in the FedRAMP Marketplace.",
              "This process supplements the Customer Responsibilities Matrix and other existing materials - all existing Rev5 materials are still required to be maintained.",
              "FedRAMP does not provide a specific template for the information required in this guidance to enable cloud service providers to share innovative solutions. As long as all requirements and recommendations in this document are addressed, providers are encouraged to share their Recommended Secure Configuration information in a way that makes the most sense for them and their customers."
            ],
            "warnings": [
              "**FedRAMP will begin enforcement of this process after March 1, 2026. Providers who do not have Recommended Secure Configuration guidance that meets the requirements and recommendations in this document will receive corrective action.**",
              "Beginning 2026-03-01, corrective action will include public notification that the provider does not meet this requirement.",
              "Beginning 2026-05-01, corrective action will include revocation of FedRAMP authorization and downgrade to FedRAMP Ready.",
              "Beginning 2026-07-01, corrective action will include complete removal from the FedRAMP Marketplace and a ban on FedRAMP authorization for three months."
            ]
          },
          "20x": {
            "is": "required",
            "signup_url": "https://www.fedramp.gov/20x/phase-two/participate/",
            "current_status": "Phase 2 Pilot",
            "start_date": "2025-11-18",
            "end_date": "2026-03-31",
            "comments": [
              "Phase 1 pilot authorizations have one year from authorization to fully address this process but must demonstrate continuous quarterly progress.",
              "Phase 2 Pilot participants must demonstrate significant progress towards addressing this process prior to submission for authorization review."
            ]
          }
        },
        "front_matter": {
          "authority": [
            {
              "reference": "Executive Order 14144 Strengthening and Promoting Innovation in the Nation’s Cybersecurity Section 3 (d), as amended by Executive Order 14306 Sustaining Select Efforts to Strengthen the Nation’s Cybersecurity and Amending Executive Order 13694 and Executive Order 14144",
              "reference_url": "https://www.federalregister.gov/documents/2025/06/11/2025-10804/sustaining-select-efforts-to-strengthen-the-nations-cybersecurity-and-amending-executive-order-13694",
              "description": " to Section 3 (b), states \"the Administrator of General Services, acting through the Director of the Federal Risk and Authorization Management Program (FedRAMP), in coordination with the Secretary of Commerce, acting through the Director of NIST, and the Secretary of Homeland Security, acting through the Director of CISA, shall develop FedRAMP policies and practices to incentivize or require cloud service providers in the FedRAMP Marketplace to produce baselines with specifications and recommendations for agency configuration of agency cloud-based systems in order to secure Federal data based on agency requirements.\""
            }
          ],
          "purpose": "All customers benefit from simple, easy to follow, easy to understand instructions for securely configuring a cloud service offering. Cloud service providers often provide a wide range of configuration options to allow individual customers to pick and choose their security posture based on their individual customer needs and are best positioned to provide instructions about the overall security impacts of many of these choices.\n\nThis process outlines simple requirements for FedRAMP authorized cloud service providers to effectively communicate the security impact of common settings to new and current agency customers."
        },
        "labels": {
          "CSO": {
            "description": "These requirements and recommendations apply to all cloud service offerings in the FedRAMP Marketplace.",
            "name": "Cloud Service Offerings"
          }
        }
      },
      "data": {
        "both": {
          "CSO": {
            "RSC-CSO-AAG": {
              "fka": "FRR-RSC-01",
              "statement": "Providers MUST create and maintain guidance that includes instructions on how to securely access, configure, operate, and decommission top-level administrative accounts that control enterprise access to the entire cloud service offering.",
              "name": "Top-Level Administrative Accounts Guidance",
              "affects": ["Providers"],
              "primary_key_word": "MUST",
              "note": "This guidance should explain how top-level administrative accounts are named and referred to in the cloud service offering."
            },
            "RSC-CSO-ASG": {
              "fka": "FRR-RSC-02",
              "statement": "Providers MUST create and maintain guidance that explains security-related settings that can be operated only by top-level administrative accounts and their security implications.",
              "name": "Top-Level Administrative Accounts Security Settings Guidance",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "RSC-CSO-PAG": {
              "fka": "FRR-RSC-03",
              "statement": "Providers SHOULD create and maintain guidance that explains security-related settings that can be operated only by privileged accounts and their security implications.",
              "name": "Privileged Accounts Security Settings Guidance",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            },
            "RSC-CSO-SDP": {
              "fka": "FRR-RSC-04",
              "statement": "Providers SHOULD set all settings to their recommended secure defaults for top-level administrative accounts and privileged accounts when initially provisioned.",
              "name": "Secure Defaults on Provisioning",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            },
            "RSC-CSO-CMP": {
              "fka": "FRR-RSC-05",
              "statement": "Providers SHOULD offer the capability to compare all current settings for top-level administrative accounts and privileged accounts to the recommended secure defaults.",
              "name": "Comparison Capability",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            },
            "RSC-CSO-EXP": {
              "fka": "FRR-RSC-06",
              "statement": "Providers SHOULD offer the capability to export all security settings in a machine-readable format.",
              "name": "Export Capability",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            },
            "RSC-CSO-API": {
              "fka": "FRR-RSC-07",
              "statement": "Providers SHOULD offer the capability to view and adjust security settings via an API or similar capability.",
              "name": "API Capability",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            },
            "RSC-CSO-MRG": {
              "fka": "FRR-RSC-08",
              "statement": "Providers SHOULD provide recommended secure configuration guidance in a machine-readable format that can be used by customers or third-party tools to compare against current settings.",
              "name": "Machine-Readable Guidance",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            },
            "RSC-CSO-PUB": {
              "fka": "FRR-RSC-09",
              "statement": "Providers SHOULD make recommended secure configuration guidance available publicly.",
              "name": "Publish Guidance",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            },
            "RSC-CSO-VRH": {
              "fka": "FRR-RSC-10",
              "statement": "Providers SHOULD provide versioning and a release history for recommended secure default settings for top-level administrative accounts and privileged accounts as they are adjusted over time.",
              "name": "Versioning and Release History",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            }
          }
        }
      }
    },
    "SCN": {
      "info": {
        "name": "Significant Change Notifications",
        "short_name": "SCN",
        "web_name": "significant-change-notifications",
        "effective": {
          "rev5": {
            "is": "optional",
            "signup_url": "",
            "current_status": "Wide Release",
            "start_date": "2026-02-27",
            "end_date": "2027-12-22",
            "comments": [
              "Rev5 Authorized providers or those seeking FedRAMP authorization MAY adopt this process in place of the traditional FedRAMP Significant Change Request process after February 27, 2026.",
              "Providers MUST address all requirements and recommendations in this process prior to full adoption.",
              "Rev5 Authorized Providers who switch to the Significant Change Notification process MUST notify FedRAMP by sending an email to info@fedramp.gov.",
              "It is up to providers to coordinate with their active agency customers to ensure agency customers will not be negatively impacted by the provider's adoption of this process.",
              "Providers seeking FedRAMP authorization who plan to follow the Significant Change Notification process must clearly note this in their authorization package",
              "The FedRAMP Marketplace will include a section that indicates if a cloud service offering is following this process."
            ]
          },
          "20x": {
            "is": "required",
            "signup_url": "https://www.fedramp.gov/20x/phase-two/participate/",
            "current_status": "Phase 2 Pilot",
            "start_date": "2025-11-18",
            "end_date": "2026-03-31",
            "comments": [
              "Phase 1 pilot authorizations have one year from authorization to fully address this process but must demonstrate continuous quarterly progress.",
              "Phase 2 Pilot participants must demonstrate significant progress towards addressing this process prior to submission for authorization review."
            ]
          }
        },
        "front_matter": {
          "authority": [
            {
              "reference": "FedRAMP Authorization Act (44 USC § 3609 (a) (7))",
              "reference_url": "https://fedramp.gov/docs/authority/law/#a-roles-and-responsibilities",
              "description": "directs the Administrator of the General Services Administration to \"coordinate with the FedRAMP Board, the Director of the Cybersecurity and Infrastructure Security Agency, and other entities identified by the Administrator, with the concurrence of the [OMB] Director and the [DHS] Secretary, to establish and regularly update a framework for continuous monitoring...\"",
              "delegation": "This responsibility is delegated to the FedRAMP Director",
              "delegation_url": "https://www.gsa.gov/directives-library/gsa-delegations-of-authority-fedramp"
            },
            {
              "reference": "OMB Memorandum M-24-15 on Modernizing FedRAMP",
              "reference_url": "https://www.fedramp.gov/docs/authority/m-24-15",
              "description": "section VI states \"FedRAMP should seek input from CSPs and develop processes that enable CSPs to maintain an agile deployment lifecycle that does not require advance Government approval, while giving the Government the visibility and information it needs to maintain ongoing confidence in the FedRAMP-authorized system and to respond timely and appropriately to incidents.\""
            }
          ],
          "purpose": "The Significant Change Notification (SCN) process establishes conditions for FedRAMP authorized cloud service providers to make most significant changes without requiring advance government approval. Agency authorizing officials who authorize the use of FedRAMP authorized cloud services are expected to account for the risk of cloud service providers making changes to improve the service.\n\nThis process broadly identifies four types of significant changes, from least impactful to most impactful:\n1. Routine Recurring\n2. Adaptive\n3. Transformative\n4. Impact Categorization\n\nThese categories, and the resulting requirements, apply only to significant changes.",
          "expected_outcomes": [
            "Cloud service providers will securely deliver new features and capabilities for government customers at the same speed and pace of delivery for commercial customers, without needing advance government approval",
            "Federal agencies will have equal access to features and capabilities as commercial customers without sacrificing the visibility and information they need to maintain ongoing confidence in the service"
          ]
        },
        "labels": {
          "CSO": {
            "description": "These requirements and recommendations apply to all cloud service offerings following the Significant Change Notification process.",
            "name": "Cloud Service Offerings"
          },
          "RTR": {
            "description": "These requirements and recommends apply to all routine recurring significant changes.",
            "name": "Routine Recurring Changes"
          },
          "ADP": {
            "description": "These requirements and recommends apply to all adaptive significant changes.",
            "name": "Adaptive Changes"
          },
          "TRF": {
            "description": "These requirements and recommends apply to all transformative significant changes.",
            "name": "Transformative Changes"
          }
        }
      },
      "data": {
        "both": {
          "CSO": {
            "SCN-CSO-NTF": {
              "fka": "FRR-SCN-01",
              "statement": "Providers MUST notify all necessary parties when Significant Change Notifications are required, including at least FedRAMP and all agency customers. Providers MAY share Significant Change Notifications publicly or with other parties.",
              "name": "Notifications",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "SCN-CSO-PAD": {
              "fka": "FRR-SCN-02",
              "statement": "Providers MUST follow the procedures documented in their security plan to plan, evaluate, test, perform, assess, and document changes.",
              "name": "Procedures and Documentation",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "SCN-CSO-EVA": {
              "fka": "FRR-SCN-03",
              "statement": "Providers MUST evaluate and type label all significant changes, then follow FedRAMP requirements for the type.",
              "name": "Evaluate Changes",
              "affects": ["Providers"],
              "primary_key_word": "MUST",
              "following_information": [
                "Is it a significant change?",
                "If it is, is it a routine recurring change?",
                "If it is not, is it an impact categorization change?",
                "If it is not, is it a transformative change?",
                "If it is not, then it is an adaptive change."
              ],
              "note": "Once a change has been identified as a significant change in general, FedRAMP recommends next determining if a change is of the type routine recurring. If it is not, work down from the highest impact to lowest to identify the type of change."
            },
            "SCN-CSO-MAR": {
              "fka": "FRR-SCN-04",
              "name": "Maintain Audit Records",
              "statement": "Providers MUST maintain auditable records of these activities and make them available to all necessary parties.",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "SCN-CSO-HIS": {
              "fka": "FRR-SCN-05",
              "name": "Historical Notifications",
              "statement": "Providers MUST keep historical Significant Change Notifications available to all necessary parties at least until the service completes its next annual assessment.",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "SCN-CSO-NOM": {
              "fka": "FRR-SCN-07",
              "name": "Notification Mechanisms",
              "statement": "Providers MAY notify necessary parties in a variety of ways as long as the mechanism for notification is clearly documented and easily accessible.",
              "affects": ["Providers"],
              "primary_key_word": "MAY"
            },
            "SCN-CSO-HRM": {
              "fka": "FRR-SCN-08",
              "name": "Human and Machine-Readable Formats",
              "statement": "Providers MUST make ALL Significant Change Notifications and related audit records available in similar human-readable and compatible machine-readable formats.",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "SCN-CSO-INF": {
              "fka": "FRR-SCN-09",
              "name": "Required Information",
              "statement": "Providers MUST include at least the following information in Significant Change Notifications:",
              "following_information": [
                "Service Offering FedRAMP ID",
                "Assessor Name (if applicable)",
                "Related POA&M (if applicable)",
                "Significant Change type and explanation of categorization",
                "Short description of change",
                "Reason for change",
                "Summary of customer impact, including changes to services and customer configuration responsibilities",
                "Plan and timeline for the change, including for the verification, assessment, and/or validation of impacted Key Security Indicators or controls",
                "Copy of the business or security impact analysis",
                "Name and title of approver"
              ],
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "SCN-CSO-ARI": {
              "fka": "FRR-SCN-10",
              "name": "Additional Relevant Information",
              "statement": "Providers MAY include additional relevant information in Significant Change Notifications.",
              "affects": ["Providers"],
              "primary_key_word": "MAY"
            },
            "SCN-CSO-CAP": {
              "fka": "FRR-SCN-EX-01",
              "name": "Corrective Action Plan Conditions",
              "statement": "Providers MAY be required to delay significant changes beyond the standard Significant Change Notification period and/or submit significant changes for approval in advance as a condition of a formal FedRAMP Corrective Action Plan or other agreement.",
              "affects": ["Providers"],
              "primary_key_word": "MAY"
            },
            "SCN-CSO-EMG": {
              "fka": "FRR-SCN-EX-02",
              "name": "Emergency Changes",
              "statement": "Providers MAY execute significant changes (including transformative changes) during an emergency or incident without meeting Significant Change Notification requirements in advance ONLY if absolutely necessary. In such emergencies, providers MUST follow all relevant procedures, notify all necessary parties, retroactively provide all Significant Change Notification materials, and complete appropriate assessment after the incident.",
              "affects": ["Providers"],
              "primary_key_word": "MAY"
            }
          },
          "RTR": {
            "SCN-RTR-NNR": {
              "fka": "FRR-SCN-RR-01",
              "name": "No Notification Requirements",
              "statement": "Providers SHOULD NOT make formal Significant Change Notifications for routine recurring changes; this type of change is exempted from the notification requirements of this process.",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD NOT",
              "notes": [
                "Activities that match the routine recurring significant change type are performed regularly and routinely by cloud service providers to address flaws or vulnerabilities, address incidents, and generally perform the typical maintenance and service delivery changes expected during day-to-day operations.",
                "These changes leverage mature processes and capabilities to identify, mitigate, and remediate risks as part of the change. They are often entirely automated and may occur without human intervention, even though they have an impact on security of the service.",
                "If the activity does not occur regularly and routinely then it cannot be a significant change of this type (e.g., replacing all physical firewalls to remediate a vulnerability is obviously not regular or routine)."
              ],
              "examples": [
                {
                  "id": "Ongoing operations",
                  "key_tests": [
                    "Routine care and feeding by staff during normal duties",
                    "No major impact to service availability",
                    "Does not require executive approval"
                  ],
                  "examples": [
                    "Provisioning or deprovisioning capacity to support service elasticity",
                    "Changing or tuning performance configurations for instances or services",
                    "Updating and maintaining operational handling of information flows and protection across physical and logical networks (e.g., updating firewall rules)",
                    "Generating or refreshing API or access tokens"
                  ]
                },
                {
                  "id": "Vulnerability Management",
                  "key_tests": [
                    "Minor, incremental patching or updates",
                    "Significant refactoring or migration process NOT required",
                    "No breaking changes"
                  ],
                  "examples": [
                    "Updating security service or endpoint signatures",
                    "Routine patching of devices, operating systems, software or libraries",
                    "Updating and deploying code that applies normal fixes and improvements as part of a regular development cycle",
                    "Vulnerability remediation activity that simply replaces a known-bad component(s) with a better version of the exact same thing, running in the exact same way with no changes to processes"
                  ]
                }
              ]
            }
          },
          "ADP": {
            "SCN-ADP-NTF": {
              "fka": "FRR-SCN-AD-01",
              "name": "Notification Requirements",
              "statement": "Providers MUST notify all necessary parties within ten business days after finishing adaptive changes, also including the following information:",
              "following_information": [
                "Summary of any new risks identified and/or POA&Ms resulting from the change (if applicable)"
              ],
              "affects": ["Providers"],
              "primary_key_word": "MUST",
              "notes": [
                "Activities that match the adaptive significant change type are a frequent and normal part of iteratively improving a service by deploying new functionality or modifying existing functionality in a way that is typically transparent to customers and does not introduce significant new security risks.",
                "In general, most changes that do not happen regularly will be adaptive changes. This change type deliberately covers a wide range of activities in a way that requires assessment and consideration."
              ],
              "examples": [
                {
                  "id": "Service adjustments",
                  "key_tests": [
                    "Requires minimal changes to security plans or procedures",
                    "Requires some careful planning and project management to implement, but does not rise to the level of planning required for transformative changes",
                    "Requires verification of existing functionality and secure configuration after implementation"
                  ],
                  "examples": [
                    "Updates to operating systems, containers, virtual machines, software or libraries with known breaking changes, complex steps, or service disruption",
                    "Deploying larger than normal incremental feature improvements in code or libraries that are the work of multiple weeks of development efforts but are not considered a major new service",
                    "Changing cryptographic modules where the new module meets the same standards and characteristics of the former",
                    "Replacing a like-for-like component where some security plan or procedure adjustments are required (e.g., scanning tool or managed database swap)",
                    "Adding models to existing approved AI services without exposing federal customer data to new services"
                  ]
                }
              ]
            }
          },
          "TRF": {
            "SCN-TRF-TPO": {
              "fka": "FRR-SCN-TR-01",
              "name": "Third-Party Review",
              "statement": "Providers SHOULD engage a third-party assessor to review the scope and impact of the planned change before starting transformative changes if human validation is necessary. This review SHOULD be limited to security decisions that require human validation. Providers MUST document this decision and justification.",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD",
              "note": "Activities that match the transformative significant change type are rare for a cloud service offering, adjusted for the size, scale, and complexity of the service. Small cloud service offerings may go years without transformative changes, while hyperscale providers may release multiple transformative changes per year.",
              "examples": [
                {
                  "id": "Transformative changes",
                  "key_tests": [
                    "Alters the service risk profile or require new or significantly different actions to address customer responsibilities",
                    "Requires significant new design, development and testing with discrete associated project planning, budget, marketing, etc.",
                    "Requires extensive updates to security assessments, documentation, and how a large number of security requirements are met and validated"
                  ],
                  "examples": [
                    "The addition, removal, or replacement of a critical third party service that handles a significant portion of information (e.g., IaaS change)",
                    "Increasing the security categorization of a service within the offering that actively handles federal customer data (does NOT include impact change of entire offering - see impact categorization change)",
                    "Replacement of underlying management planes or paradigm shift in workload orchestration (e.g., bare-metal servers or virtual machines to containers, migration to kubernetes)",
                    "Datacenter migration where large amounts of federal customer data is moved across boundaries different from normal day-to-day operations",
                    "Adding a new AI-based capability that impacts federal customer data in a different way than existing services or capabilities (such as integrating a new third-party service or training on federal customer data)"
                  ]
                }
              ]
            },
            "SCN-TRF-NIP": {
              "fka": "FRR-SCN-TR-02",
              "name": "Notification of Initial Plans",
              "statement": "Providers MUST notify all necessary parties of initial plans for transformative changes at least 30 business days before starting transformative changes.",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "SCN-TRF-NFP": {
              "fka": "FRR-SCN-TR-03",
              "name": "Notification of Final Plans",
              "statement": "Providers MUST notify all necessary parties of final plans for transformative changes at least 10 business days before starting transformative changes.",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "SCN-TRF-NAF": {
              "fka": "FRR-SCN-TR-04",
              "name": "Notification After Finishing",
              "statement": "Providers MUST notify all necessary parties within 5 business days after finishing transformative changes, also including the following information:",
              "following_information": [
                "Updates to all previously sent information"
              ],
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "SCN-TRF-NAV": {
              "fka": "FRR-SCN-TR-05",
              "name": "Notification After Verification",
              "statement": "Providers MUST notify all necessary parties within 5 business days after completing the verification, assessment, and/or validation of transformative changes, also including the following information:",
              "following_information": [
                "Updates to all previously sent information",
                "Summary of any new risks identified and/or POA&Ms resulting from the change (if applicable)",
                "Copy of the security assessment report (if applicable)"
              ],
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "SCN-TRF-UPD": {
              "fka": "FRR-SCN-TR-06",
              "name": "Update Documentation",
              "statement": "Providers MUST publish updated service documentation and other materials to reflect transformative changes within 30 business days after finishing transformative changes.",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "SCN-TRF-OPT": {
              "fka": "FRR-SCN-TR-07",
              "name": "Option to Opt Out",
              "statement": "Providers MUST allow agency customers to OPT OUT of transformative changes whenever feasible.",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            }
          }
        }
      }
    },
    "UCM": {
      "info": {
        "name": "Using Cryptographic Modules",
        "short_name": "UCM",
        "web_name": "using-cryptographic-modules",
        "effective": {
          "rev5": {
            "is": "no"
          },
          "20x": {
            "is": "required",
            "signup_url": "https://www.fedramp.gov/20x/phase-two/participate/",
            "current_status": "Phase 2 Pilot",
            "start_date": "2025-11-18",
            "end_date": "2026-03-31",
            "comments": [
              "Phase 1 pilot authorizations have one year from authorization to fully address this process but must demonstrate continuous quarterly progress.",
              "Phase 2 Pilot participants must demonstrate significant progress towards addressing this process prior to submission for authorization review."
            ]
          }
        },
        "front_matter": {
          "purpose": "This set of requirements and recommendations converts the existing FedRAMP Policy for Cryptographic Module Selection and Use (https://www.fedramp.gov/resources/documents/FedRAMP_Policy_for_Cryptographic_Module_Selection_v1.1.0.pdf) to the simpler FedRAMP 20x style and clarifies the implementation expectations for FedRAMP 20x.\n\nThe notable change from the default Rev5 Policy for Cryptographic Module Selection and Use is that the use of cryptographic modules (or update streams) validated under the NIST Cryptographic Module Validation Program are not explicitly required when cryptographic modules are used to protect federal customer data in cloud service offerings seeking FedRAMP authorization at the Moderate impact level. This acknowledges that not all Moderate impact federal customer data is considered “sensitive” and allows both cloud service providers and agency customers to make risk-based decisions about their use of Moderate impact services for agency use cases that do not include sensitive data.\n\nFedRAMP recommends that cloud service providers seeking FedRAMP authorization at the Moderate impact level use such cryptographic modules whenever technically feasible and reasonable but acknowledges there may be sound reasons not to do so across the board at the Moderate impact level. As always, the reasoning and justification for such decisions must be documented by the cloud service provider."
        },
        "labels": {
          "CSO": {
            "description": "These requirements and recommendations apply to all FedRAMP Validated cloud service offerings.",
            "name": "Cloud Service Offerings"
          }
        }
      },
      "data": {
        "20x": {
          "CSO": {
            "UCM-CSO-CMD": {
              "fka": "FRR-UCM-01",
              "statement": "Providers MUST document the cryptographic modules used in each service (or groups of services that use the same modules) where cryptographic services are used to protect federal customer data, including whether these modules are validated under the NIST Cryptographic Module Validation Program or are update streams of such modules.",
              "name": "Cryptographic Module Documentation",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "UCM-CSO-CAT": {
              "fka": "FRR-UCM-02",
              "statement": "Providers SHOULD configure agency tenants by default to use cryptographic services that use cryptographic modules or update streams of cryptographic modules with active validations under the NIST Cryptographic Module Validation Program when such modules are available.",
              "name": "Configuration of Agency Tenants",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            },
            "UCM-CSO-UVM": {
              "fkas": ["FRR-UCM-03", "FRR-UCM-04"],
              "varies_by_level": {
                "low": {
                  "statement": "Providers MAY use cryptographic modules or update streams of cryptographic modules with active validations under the NIST Cryptographic Module Validation Program when using cryptographic services to protect federal customer data.",
                  "primary_key_word": "MAY"
                },
                "moderate": {
                  "statement": "Providers SHOULD use cryptographic modules or update streams of cryptographic modules with active validations under the NIST Cryptographic Module Validation Program when using cryptographic services to protect federal customer data.",
                  "primary_key_word": "SHOULD"
                },
                "high": {
                  "statement": "Providers MUST use cryptographic modules or update streams of cryptographic modules with active validations under the NIST Cryptographic Module Validation Program when using cryptographic services to protect federal customer data.",
                  "primary_key_word": "MUST"
                }
              },
              "name": "Using Validated Cryptographic Modules",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            }
          }
        }
      }
    },
    "VDR": {
      "info": {
        "name": "Vulnerability Detection and Response",
        "short_name": "VDR",
        "web_name": "vulnerability-detection-and-response",
        "effective": {
          "rev5": {
            "is": "optional",
            "signup_url": "https://docs.google.com/forms/d/e/1FAIpQLSePkNZNzB3hke39KwT1c7aGhAcsNLm_xz4NZuPcqUfq01rDgg/viewform",
            "current_status": "Open Beta",
            "start_date": "2026-02-02",
            "end_date": "2026-05-22",
            "comments": [
              "**Providers MUST notify FedRAMP of intent to participate in the Vulnerability Detection and Response Rev5 Open Beta by submitting a sign-up form to FedRAMP.**",
              "Rev5 Authorized providers MAY adopt this process beginning February 2, 2026 as part of the Open Beta.",
              "Providers MUST plan to address all requirements and recommendations in this process by the end of the Open Beta on May 22, 2026.",
              "It is up to providers to coordinate with their active agency customers to ensure agency customers will not be negatively impacted by the provider's participation in this beta.",
              "FedRAMP recommends that participants in the Vulnerability Detection and Response beta also adopt the Authorization Data Sharing process and the Significant Change Notifications process."
            ]
          },
          "20x": {
            "is": "required",
            "signup_url": "https://www.fedramp.gov/20x/phase-two/participate/",
            "current_status": "Phase 2 Pilot",
            "start_date": "2025-11-18",
            "end_date": "2026-03-31",
            "comments": [
              "Phase 1 pilot authorizations have one year from authorization to fully address this process but must demonstrate continuous quarterly progress.",
              "Phase 2 Pilot participants must demonstrate significant progress towards addressing this process prior to submission for authorization review."
            ]
          }
        },
        "front_matter": {
          "authority": [
            {
              "reference": "OMB Circular A-130, Managing Information as a Strategic Resource",
              "reference_url": "https://whitehouse.gov/wp-content/uploads/legacydrupalfiles/omb/circulars/A130/a130revised.pdf",
              "description": "OMB Circular A-130 defines continuous monitoring as \"maintaining ongoing awareness of information security, vulnerabilities, threats, and incidents to support agency risk management decisions.\""
            },
            {
              "reference": "44 USC § 3609 (a)(7)",
              "reference_url": "https://fedramp.gov/docs/authority/law/#a-roles-and-responsibilities",
              "description": "The FedRAMP Authorization Act (44 USC § 3609 (a)(7)) directs the Administrator of the General Services Administration to \"coordinate with the FedRAMP Board, the Director of the Cybersecurity and Infrastructure Security Agency, and other entities identified by the Administrator, with the concurrence of the Director and the Secretary, to establish and regularly update a framework for continuous monitoring...\"",
              "delegation": "This responsibility is delegated to the FedRAMP Director",
              "delegation_url": "https://www.gsa.gov/directives-library/gsa-delegations-of-authority-fedramp"
            }
          ],
          "purpose": "The FedRAMP Vulnerability Detection and Response process ensures FedRAMP Authorized cloud service offerings use automated systems to effectively and continuously identify, analyze, prioritize, mitigate, and remediate vulnerabilities and related exposures to threats; and that information related to these activities are effectively and continuously reported to federal agencies for the purposes of ongoing authorization.\n\nThe Vulnerability Detection and Response process defines minimum security requirements that cloud service providers must meet to be FedRAMP Authorized while allowing them flexibility in how they implement and adopt the majority of FedRAMP's requirements and recommendations. This creates a marketplace where cloud service providers can compete based on their individual approach and prioritization of security and agencies can choose to adopt cloud services with less effective security programs for less sensitive use cases while prioritizing cloud services with high performing security programs when needed.\n\nOver time, FedRAMP will automatically review the machine-readable authorization data shared by participating cloud service providers to begin scoring cloud service offerings based on how effectively they meet or exceed the requirements and recommendations in this and other FedRAMP 20x processes.\n\nAll existing FedRAMP requirements, including control statements, standards, and other guidelines that reference vulnerability scanning or formal Plans of Action and Milestones (POA&Ms) are superseded by this process and MAY be ignored by providers of cloud service offerings that have met the requirements to adopt this process with approval by FedRAMP.",
          "expected_outcomes": [
            "Cloud service providers following commercial security best practices will be able to meet and validate FedRAMP security requirements with simple changes and automated capabilities",
            "Federal agencies will be able to easily, quickly, and effectively review and consume security information about the service to make informed risk-based authorizations based on their use cases"
          ]
        },
        "labels": {
          "CSO": {
            "description": "These requirements and recommendations apply to all cloud service offerings following the Vulnerability Detection and Response process.",
            "name": "Cloud Service Offerings"
          },
          "AGM": {
            "description": "These requirements and recommendations for agencies apply to all agencies reusing a FedRAMP Certification or Validation for a cloud service offering following the Vulnerability Detection and Response process.",
            "name": "Agencies"
          },
          "TFR": {
            "description": "These requirements and recommendations apply to timeframes for vulnerability detection and response.",
            "name": "Timeframes"
          },
          "RPT": {
            "description": "These requirements and recommendations apply to reporting related to vulnerability detection and response.",
            "name": "Reporting"
          }
        }
      },
      "data": {
        "both": {
          "CSO": {
            "VDR-CSO-DET": {
              "fka": "FRR-VDR-01",
              "statement": "Providers MUST systematically, persistently, and promptly discover and identify vulnerabilities within their cloud service offering using appropriate techniques such as assessment, scanning, threat intelligence, vulnerability disclosure mechanisms, bug bounties, supply chain monitoring, and other relevant capabilities; this process is called vulnerability detection.",
              "affects": ["Providers"],
              "name": "Vulnerability Detection",
              "primary_key_word": "MUST"
            },
            "VDR-CSO-RES": {
              "fka": "FRR-VDR-02",
              "statement": "Providers MUST systematically, persistently, and promptly track, evaluate, monitor, mitigate, remediate, assess exploitation of, report, and otherwise manage all detected vulnerabilities within their cloud service offering; this process is called vulnerability response.",
              "affects": ["Providers"],
              "name": "Vulnerability Response",
              "primary_key_word": "MUST",
              "note": "If it is not possible to fully mitigate or remediate detected vulnerabilities, providers SHOULD instead partially mitigate vulnerabilities promptly, progressively, and persistently."
            },
            "VDR-CSO-TFR": {
              "fka": "FRR-VDR-03",
              "statement": "Providers MUST follow the requirements and recommendations outlined in FRR-VDR-TF regarding timeframes for vulnerability detection and response.",
              "name": "Timeframe Requirements",
              "note": "Providers are strongly encouraged to build programs that consistently exceed these thresholds. Performance will be measured by FedRAMP for comparison between providers and scoring within the FedRAMP Marketplace.",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "VDR-CSO-SIR": {
              "fka": "FRR-VDR-04",
              "statement": "Providers MAY sample effectively identical information resources, especially machine-based information resources, when performing vulnerability detection UNLESS doing so would decrease the efficiency or effectiveness of vulnerability detection.",
              "name": "Sampling Identical Resources",
              "affects": ["Providers"],
              "primary_key_word": "MAY"
            },
            "VDR-CSO-GRV": {
              "fka": "FRR-VDR-05",
              "statement": "Providers SHOULD evaluate detected vulnerabilities, considering the context of the cloud service offering, to identify logical groupings of affected information resources that may improve the efficiency and effectiveness of vulnerability response by consolidating further activity; requirements and recommendations in this process are then applied to these consolidated groupings of vulnerabilities instead of each individual detected instance.",
              "name": "Grouping Vulnerabilities",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            },
            "VDR-CSO-EFP": {
              "fka": "FRR-VDR-06",
              "statement": "Providers SHOULD evaluate detected vulnerabilities, considering the context of the cloud service offering, to determine if they are false positive vulnerabilities.",
              "name": "Evaluate False Positives",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            },
            "VDR-CSO-ELX": {
              "fka": "FRR-VDR-07",
              "statement": "Providers MUST evaluate detected vulnerabilities, considering the context of the cloud service offering, to determine if they are likely exploitable vulnerabilities.",
              "name": "Evaluate Exploitability",
              "affects": ["Providers"],
              "primary_key_word": "MUST",
              "note": "The simple reality is that most traditional vulnerabilities discovered by scanners or during assessment are not likely to be exploitable; exploitation typically requires an unrealistic set of circumstances that will not occur during normal operation. The likelihood of exploitation will vary depending on so many factors that FedRAMP will not recommend a specific framework for approaching this beyond the recommendations and requirements in this document.\n\nThe proof, ultimately, is in the pudding - providers who regularly evaluate vulnerabilities as not likely exploitable without careful consideration are more likely to suffer from an adverse impact where the root cause was an exploited vulnerability that was improperly evaluated. If done recklessly or deliberately, such actions will have a potential adverse impact on a provider's FedRAMP authorization."
            },
            "VDR-CSO-EIR": {
              "fka": "FRR-VDR-08",
              "statement": "Providers MUST evaluate detected vulnerabilities, considering the context of the cloud service offering, to determine if they are internet-reachable vulnerabilities.",
              "name": "Evaluate Internet-Reachability",
              "affects": ["Providers"],
              "primary_key_word": "MUST",
              "notes": [
                "FedRAMP focuses on internet-reachable (rather than internet-accessible) to ensure that any service that might receive a payload from the internet is prioritized if that service has a vulnerability that can be triggered by processing the data in the payload.",
                "The simplest way to prevent exploitation of internet-reachable vulnerabilities is to intercept, inspect, filter, sanitize, reject, or otherwise deflect triggering payloads before they are processed by the vulnerable resource; once this prevention is in place the vulnerability should no longer be considered an internet-reachable vulnerability.",
                "A classic example of an internet-reachable vulnerability on systems that are not typically internet-accessible is [SQL injection](https://en.wikipedia.org/wiki/SQL_injection), where an application stack behind a load balancer and firewall with no ability to route traffic to or from the internet can receive a payload indirectly from the internet that triggers the manipulation or compromise of data in a database that can only be accessed by an authorized connection from the application server on a private network.",
                "Another simple example is the infamous Log4Shell (https://en.wikipedia.org/wiki/Log4Shell) vulnerability from 2021, where exploitation was possible via vulnerable internet-reachable resources deep in the application stack that were often not internet-accessible themselves."
              ]
            },
            "VDR-CSO-EPA": {
              "fka": "FRR-VDR-09",
              "statement": "Providers MUST evaluate detected vulnerabilities, considering the context of the cloud service offering, to estimate the potential adverse impact of exploitation on government customers AND assign one of the following potential adverse impact ratings:",
              "name": "Estimate Potential Adverse Impact",
              "affects": ["Providers"],
              "primary_key_word": "MUST",
              "following_information_bullets": [
                "**N1**: Exploitation could be expected to have negligible adverse effects on one or more agencies that use the cloud service offering.",
                "**N2**: Exploitation could be expected to have limited adverse effects on one or more agencies that use the cloud service offering.",
                "**N3**: Exploitation could be expected to have a serious adverse effect on one agency that uses the cloud service offering.",
                "**N4**: Exploitation could be expected to have a catastrophic adverse effect on one agency that uses the cloud service offering OR a serious adverse effect on more than one federal agency that uses the cloud service offering.",
                "**N5**: Exploitation could be expected to have a catastrophic adverse effect on more than one agency that uses the cloud service offering."
              ]
            },
            "VDR-CSO-EFA": {
              "fka": "FRR-VDR-10",
              "statement": "Providers SHOULD consider at least the following factors when considering the context of the cloud service offering to evaluate detected vulnerabilities:",
              "name": "Evaluation Factors",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD",
              "following_information": [
                "**Criticality**: How important are the systems or information that might be impacted by the vulnerability?",
                "**Reachability**: How might a threat actor reach the vulnerability and how likely is that?",
                "**Exploitability**: How easy is it for a threat actor to exploit the vulnerability and how likely is that?",
                "**Detectability**: How easy is it for a threat actor to become aware of the vulnerability and how likely is that?",
                "**Prevalence**: How much of the cloud service offering is affected by the vulnerability?",
                "**Privilege**: How much privileged authority or access is granted or can be gained from exploiting the vulnerability?",
                "**Proximate Vulnerabilities**: How does this vulnerability interact with previously detected vulnerabilities, especially partially or fully mitigated vulnerabilities?",
                "**Known Threats**: How might already known threats leverage the vulnerability and how likely is that?"
              ]
            },
            "VDR-CSO-DOC": {
              "fka": "FRR-VDR-11",
              "statement": "Providers MUST document the reason and resulting implications for their customers when choosing not to meet FedRAMP recommendations in this process; this documentation MUST be included in the authorization data for the cloud service offering.",
              "name": "Documenting Reasons",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "VDR-CSO-DFR": {
              "fka": "FRR-VDR-AY-02",
              "statement": "Providers SHOULD make design and architecture decisions for their cloud service offering that mitigate the risk of vulnerabilities by default AND decrease the risk and complexity of vulnerability detection and response.",
              "name": "Design For Resilience",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            },
            "VDR-CSO-ADT": {
              "fka": "FRR-VDR-AY-03",
              "statement": "Providers SHOULD use automated services to improve and streamline vulnerability detection and response.",
              "name": "Automate Detection",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            },
            "VDR-CSO-DAC": {
              "fka": "FRR-VDR-AY-04",
              "statement": "Providers SHOULD automatically perform vulnerability detection on representative samples of new or significantly changed information resources.",
              "name": "Detection After Changes",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            },
            "VDR-CSO-MSP": {
              "fka": "FRR-VDR-AY-05",
              "statement": "Providers SHOULD NOT weaken the security of information resources to facilitate vulnerability scanning or assessment activities.",
              "name": "Maintain Security Postures",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD NOT"
            },
            "VDR-CSO-AKE": {
              "fka": "FRR-VDR-AY-06",
              "statement": "Providers SHOULD NOT deploy or otherwise activate new machine-based information resources with Known Exploited Vulnerabilities.",
              "name": "Avoid Known Exploited Vulnerabilities",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD NOT"
            },
            "VDR-CSO-ARP": {
              "fka": "FRR-VDR-EX-01",
              "statement": "Providers MAY be required to share additional vulnerability information, alternative reports, or to report at an alternative frequency as a condition of a FedRAMP Corrective Action Plan or other agreements with federal agencies.",
              "name": "Additional Reporting Requirements",
              "affects": ["Providers"],
              "primary_key_word": "MAY"
            },
            "VDR-CSO-ADV": {
              "fka": "FRR-VDR-EX-02",
              "statement": "Providers MAY be required to provide additional information or details about vulnerabilities, including sensitive information that would likely lead to exploitation, as part of review, response or investigation by necessary parties.",
              "name": "Additional Details",
              "affects": ["Providers"],
              "primary_key_word": "MAY"
            },
            "VDR-CSO-DNR": {
              "fka": "FRR-VDR-EX-03",
              "statement": "Providers MUST NOT use this process to reject requests for additional information from necessary parties which also include law enforcement, Congress, and Inspectors General.",
              "name": "Do Not Reject Requests",
              "affects": ["Providers"],
              "primary_key_word": "MUST NOT"
            }
          },
          "RPT": {
            "VDR-RPT-REQ": {
              "fka": "FRR-VDR-RP-01",
              "statement": "Providers MUST report vulnerability detection and response activity to all necessary parties persistently, summarizing ALL activity since the previous report; these reports are authorization data and are subject to the FedRAMP Authorization Data Sharing (ADS) process.",
              "name": "Monthly Reporting",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "VDR-RPT-HLO": {
              "fka": "FRR-VDR-RP-02",
              "statement": "Providers SHOULD include high-level overviews of ALL vulnerability detection and response activities conducted during this period for the cloud service offering; this includes vulnerability disclosure programs, bug bounty programs, penetration testing, assessments, etc.",
              "name": "High-Level Overviews",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD"
            },
            "VDR-RPT-NID": {
              "fka": "FRR-VDR-RP-03",
              "statement": "Providers MUST NOT irresponsibly disclose specific sensitive information about vulnerabilities that would likely lead to exploitation, but MUST disclose sufficient information for informed risk-based decision-making to all necessary parties.",
              "name": "No Irresponsible Disclosure",
              "affects": ["Providers"],
              "primary_key_word": "MUST NOT",
              "note": "See FRR-VDR-EX for exceptions to this requirement."
            },
            "VDR-RPT-RPD": {
              "fka": "FRR-VDR-RP-04",
              "statement": "Providers MAY responsibly disclose vulnerabilities publicly or with other parties if the provider determines doing so will NOT likely lead to exploitation.",
              "name": "Responsible Public Disclosure",
              "affects": ["Providers"],
              "primary_key_word": "MAY"
            },
            "VDR-RPT-VDT": {
              "fka": "FRR-VDR-RP-05",
              "statement": "Providers MUST include the following information (if applicable) on detected vulnerabilities when reporting on vulnerability detection and response activity, UNLESS it is an accepted vulnerability:",
              "name": "Vulnerability Details",
              "following_information": [
                "Provider's internally assigned tracking identifier",
                "Time and source of the detection",
                "Time of completed evaluation",
                "Is it an internet-reachable vulnerability or not?",
                "Is it a likely exploitable vulnerability or not?",
                "Historically and currently estimated potential adverse impact of exploitation",
                "Time and level of each completed and evaluated reduction in potential adverse impact",
                "Estimated time and target level of next reduction in potential adverse impact",
                "Is it currently or is it likely to become an overdue vulnerability or not? If so, explain.",
                "Any supplementary information the provider responsibly determines will help federal agencies assess or mitigate the risk to their federal customer data within the cloud service offering resulting from the vulnerability",
                "Final disposition of the vulnerability"
              ],
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "VDR-RPT-AVI": {
              "fka": "FRR-VDR-RP-06",
              "statement": "Providers MUST include the following information on accepted vulnerabilities when reporting on vulnerability detection and response activity:",
              "name": "Accepted Vulnerability Info",
              "following_information": [
                "Provider's internally assigned tracking identifier",
                "Time and source of the detection",
                "Time of completed evaluation",
                "Is it an internet-reachable vulnerability or not?",
                "Is it a likely exploitable vulnerability or not?",
                "Currently estimated potential adverse impact of exploitation",
                "Explanation of why this is an accepted vulnerability",
                "Any supplementary information the provider determines will responsibly help federal agencies assess or mitigate the risk to their federal customer data within the cloud service offering resulting from the accepted vulnerability"
              ],
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            }
          },
          "TFR": {
            "VDR-TFR-MHR": {
              "fka": "FRR-VDR-TF-01",
              "statement": "Providers MUST report vulnerability detection and response activity to all necessary parties in a consistent format that is human readable at least monthly.",
              "name": "Monthly Human-Readable",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "VDR-TFR-KEV": {
              "fka": "FRR-VDR-TF-02",
              "statement": "Providers SHOULD remediate Known Exploited Vulnerabilities according to the due dates in the CISA Known Exploited Vulnerabilities Catalog (even if the vulnerability has been fully mitigated) as required by CISA Binding Operational Directive (BOD) 22-01 or any successor guidance from CISA.",
              "name": "Remediate KEVs",
              "affects": ["Providers"],
              "primary_key_word": "SHOULD",
              "reference": "CISA BOD 22-01",
              "reference_url": "https://www.cisa.gov/news-events/directives/bod-22-01-reducing-significant-risk-known-exploited-vulnerabilities"
            },
            "VDR-TFR-MAV": {
              "fka": "FRR-VDR-TF-03",
              "statement": "Providers MUST categorize any vulnerability that is not or will not be fully mitigated or remediated within 192 days of evaluation as an accepted vulnerability.",
              "name": "Mark Accepted Vulnerabilities",
              "affects": ["Providers"],
              "primary_key_word": "MUST"
            },
            "VDR-TFR-MRH": {
              "fkas": [
                "FRR-VDR-TF-LO-01",
                "FRR-VDR-TF-MO-01",
                "FRR-VDR-TF-HI-01"
              ],
              "varies_by_level": {
                "low": {
                  "statement": "Providers SHOULD make all recent historical vulnerability detection and response activity available in a machine-readable format for automated retrieval by all necessary parties (e.g. using an API service or similar); this information SHOULD be updated persistently, at least once every month.",
                  "primary_key_word": "SHOULD",
                  "timeframe_type": "month",
                  "timeframe_num": 1
                },
                "moderate": {
                  "statement": "Providers SHOULD make all recent historical vulnerability detection and response activity available in a machine-readable format for automated retrieval by all necessary parties (e.g. using an API service or similar); this information SHOULD be updated persistently, at least once every 14 days.",
                  "primary_key_word": "SHOULD",
                  "timeframe_type": "days",
                  "timeframe_num": 14
                },
                "high": {
                  "statement": "Providers SHOULD make all recent historical vulnerability detection and response activity available in a machine-readable format for automated retrieval by all necessary parties (e.g. using an API service or similar); this information SHOULD be updated persistently, at least once every 7 days.",
                  "primary_key_word": "SHOULD",
                  "timeframe_type": "days",
                  "timeframe_num": 7
                }
              },
              "name": "Machine-Readable History",
              "affects": ["Providers"]
            },
            "VDR-TFR-PSD": {
              "fkas": [
                "FRR-VDR-TF-LO-02",
                "FRR-VDR-TF-MO-02",
                "FRR-VDR-TF-HI-02"
              ],
              "varies_by_level": {
                "low": {
                  "statement": "Providers SHOULD persistently perform vulnerability detection on representative samples of similar machine-based information resources, at least once every 7 days.",
                  "primary_key_word": "SHOULD",
                  "timeframe_type": "days",
                  "timeframe_num": 7
                },
                "moderate": {
                  "statement": "Providers SHOULD persistently perform vulnerability detection on representative samples of similar machine-based information resources, at least once every 3 days.",
                  "primary_key_word": "SHOULD",
                  "timeframe_type": "days",
                  "timeframe_num": 3
                },
                "high": {
                  "statement": "Providers SHOULD persistently perform vulnerability detection on representative samples of similar machine-based information resources, at least once per day.",
                  "primary_key_word": "SHOULD",
                  "timeframe_type": "days",
                  "timeframe_num": 1
                }
              },
              "name": "Persistent Sample Detection",
              "affects": ["Providers"]
            },
            "VDR-TFR-PDD": {
              "fkas": [
                "FRR-VDR-TF-LO-03",
                "FRR-VDR-TF-MO-03",
                "FRR-VDR-TF-HI-03"
              ],
              "varies_by_level": {
                "low": {
                  "statement": "Providers SHOULD persistently perform vulnerability detection on all information resources that are likely to drift, at least once every month.",
                  "primary_key_word": "SHOULD",
                  "timeframe_type": "month",
                  "timeframe_num": 1
                },
                "moderate": {
                  "statement": "Providers SHOULD persistently perform vulnerability detection on all information resources that are likely to drift, at least once every 14 days.",
                  "primary_key_word": "SHOULD",
                  "timeframe_type": "days",
                  "timeframe_num": 14
                },
                "high": {
                  "statement": "Providers SHOULD persistently perform vulnerability detection on all information resources that are likely to drift, at least once every 7 days.",
                  "primary_key_word": "SHOULD",
                  "timeframe_type": "days",
                  "timeframe_num": 7
                }
              },
              "name": "Persistent Drift Detection",
              "affects": ["Providers"]
            },
            "VDR-TFR-PCD": {
              "fka": "FRR-VDR-TF-LO-04",
              "varies_by_level": {
                "low": {
                  "statement": "Providers SHOULD persistently perform vulnerability detection on all information resources that are NOT likely to drift, at least once every six months.",
                  "primary_key_word": "SHOULD",
                  "timeframe_type": "month",
                  "timeframe_num": 6
                },
                "moderate": {
                  "statement": "Providers SHOULD persistently perform vulnerability detection on all information resources that are NOT likely to drift, at least once every month.",
                  "primary_key_word": "SHOULD",
                  "timeframe_type": "month",
                  "timeframe_num": 1
                },
                "high": {
                  "statement": "Providers SHOULD persistently perform vulnerability detection on all information resources that are NOT likely to drift, at least once every month.",
                  "primary_key_word": "SHOULD",
                  "timeframe_type": "month",
                  "timeframe_num": 1
                }
              },
              "name": "Persistent Complete Detection",
              "affects": ["Providers"]
            },
            "VDR-TFR-EVU": {
              "fkas": [
                "FRR-VDR-TF-LO-05",
                "FRR-VDR-TF-MO-05",
                "FRR-VDR-TF-HI-05"
              ],
              "varies_by_level": {
                "low": {
                  "statement": "Providers SHOULD evaluate ALL vulnerabilities as required by FRR-VDR-07, FRR-VDR-08, and FRR-VDR-09 within 7 days of detection.",
                  "primary_key_word": "SHOULD",
                  "timeframe_type": "days",
                  "timeframe_num": 7
                },
                "moderate": {
                  "statement": "Providers SHOULD evaluate ALL vulnerabilities as required by FRR-VDR-07, FRR-VDR-08, and FRR-VDR-09 within 5 days of detection.",
                  "primary_key_word": "SHOULD",
                  "timeframe_type": "days",
                  "timeframe_num": 5
                },
                "high": {
                  "statement": "Providers SHOULD evaluate ALL vulnerabilities as required by FRR-VDR-07, FRR-VDR-08, and FRR-VDR-09 within 2 days of detection.",
                  "primary_key_word": "SHOULD",
                  "timeframe_type": "days",
                  "timeframe_num": 2
                }
              },
              "name": "Evaluate Vulnerabilities Quickly",
              "affects": ["Providers"]
            },
            "VDR-TFR-MRV": {
              "fkas": [
                "FRR-VDR-TF-LO-06",
                "FRR-VDR-TF-MO-07",
                "FRR-VDR-TF-HI-08"
              ],
              "varies_by_level": {
                "low": {
                  "statement": "Providers SHOULD partially mitigate, fully mitigate, or remediate vulnerabilities to a lower potential adverse impact within the timeframes from evaluation shown below (in days), factoring for the current potential adverse impact, internet reachability, and likely exploitability:",
                  "primary_key_word": "SHOULD",
                  "pain_timeframes": [
                    {
                      "pain": 5,
                      "max_days_irv_lev": 4,
                      "max_days_nirv_lev": 8,
                      "max_days_nlev": 32
                    },
                    {
                      "pain": 4,
                      "max_days_irv_lev": 8,
                      "max_days_nirv_lev": 32,
                      "max_days_nlev": 64
                    },
                    {
                      "pain": 3,
                      "max_days_irv_lev": 32,
                      "max_days_nirv_lev": 64,
                      "max_days_nlev": 192
                    },
                    {
                      "pain": 2,
                      "max_days_irv_lev": 96,
                      "max_days_nirv_lev": 160,
                      "max_days_nlev": 192
                    }
                  ]
                },
                "moderate": {
                  "statement": "Providers SHOULD partially mitigate, fully mitigate, or remediate vulnerabilities to a lower potential adverse impact within the timeframes from evaluation shown below (in days), factoring for the current potential adverse impact, internet reachability, and likely exploitability:",
                  "primary_key_word": "SHOULD",
                  "pain_timeframes": [
                    {
                      "pain": 5,
                      "max_days_irv_lev": 2,
                      "max_days_nirv_lev": 4,
                      "max_days_nlev": 16
                    },
                    {
                      "pain": 4,
                      "max_days_irv_lev": 4,
                      "max_days_nirv_lev": 8,
                      "max_days_nlev": 64
                    },
                    {
                      "pain": 3,
                      "max_days_irv_lev": 16,
                      "max_days_nirv_lev": 32,
                      "max_days_nlev": 128
                    },
                    {
                      "pain": 2,
                      "max_days_irv_lev": 48,
                      "max_days_nirv_lev": 128,
                      "max_days_nlev": 192
                    }
                  ]
                },
                "high": {
                  "statement": "Providers SHOULD partially mitigate vulnerabilities to a lower potential adverse impact within the maximum time-frames from evaluation shown below (in days), factoring for the current potential adverse impact, internet reachability, and likely exploitability:",
                  "primary_key_word": "SHOULD",
                  "pain_timeframes": [
                    {
                      "pain": 5,
                      "max_days_irv_lev": 0.5,
                      "max_days_nirv_lev": 1,
                      "max_days_nlev": 8
                    },
                    {
                      "pain": 4,
                      "max_days_irv_lev": 2,
                      "max_days_nirv_lev": 8,
                      "max_days_nlev": 32
                    },
                    {
                      "pain": 3,
                      "max_days_irv_lev": 8,
                      "max_days_nirv_lev": 16,
                      "max_days_nlev": 64
                    },
                    {
                      "pain": 2,
                      "max_days_irv_lev": 24,
                      "max_days_nirv_lev": 96,
                      "max_days_nlev": 192
                    }
                  ]
                }
              },
              "name": "Mitigate and Remediate Vulnerabilities Promptly",
              "affects": ["Providers"]
            },
            "VDR-TFR-RMN": {
              "fkas": [
                "FRR-VDR-TF-LO-07",
                "FRR-VDR-TF-MO-09",
                "FRR-VDR-TF-HI-09"
              ],
              "statement": "Providers SHOULD mitigate or remediate remaining vulnerabilities during routine operations as determined necessary by the provider.",
              "name": "Remaining Vulnerabilities",
              "affects": ["Providers"]
            },
            "VDR-TFR-IRI": {
              "fkas": ["FRR-VDR-TF-MO-06", "FRR-VDR-TF-HI-06"],
              "varies_by_level": {
                "low": {
                  "statement": "Providers MAY treat internet-reachable likely exploitable vulnerabilities with a potential adverse impact of N4 or N5 as a security incident until they are partially mitigated to N3 or below.",
                  "primary_key_word": "MAY"
                },
                "moderate": {
                  "statement": "Providers SHOULD treat internet-reachable likely exploitable vulnerabilities with a potential adverse impact of N4 or N5 as a security incident until they are partially mitigated to N3 or below.",
                  "primary_key_word": "SHOULD"
                },
                "high": {
                  "statement": "Providers SHOULD treat internet-reachable likely exploitable vulnerabilities with a potential adverse impact of N4 or N5 as a security incident until they are partially mitigated to N3 or below.",
                  "primary_key_word": "SHOULD"
                }
              },
              "name": "Internet-Reachable Incidents",
              "affects": ["Providers"]
            },
            "VDR-TFR-NRI": {
              "fkas": ["FRR-VDR-TF-HI-07"],
              "varies_by_level": {
                "low": {
                  "statement": "Providers MAY treat likely exploitable vulnerabilities that are NOT internet-reachable with a potential adverse impact of N5 as a security incident until they are partially mitigated to N4 or below.",
                  "primary_key_word": "MAY"
                },
                "moderate": {
                  "statement": "Providers MAY treat likely exploitable vulnerabilities that are NOT internet-reachable with a potential adverse impact of N5 as a security incident until they are partially mitigated to N4 or below.",
                  "primary_key_word": "MAY"
                },
                "high": {
                  "statement": "Providers SHOULD treat likely exploitable vulnerabilities that are NOT internet-reachable with a potential adverse impact of N5 as a security incident until they are partially mitigated to N4 or below.",
                  "primary_key_word": "SHOULD"
                }
              },
              "name": "Non-Internet-Reachable Incidents",
              "affects": ["Providers"]
            }
          },
          "AGM": {
            "VDR-AGM-RVR": {
              "fka": "FRR-VDR-AG-01",
              "statement": "Agencies SHOULD review the information provided in vulnerability reports at appropriate and reasonable intervals commensurate with the expectations and risk posture indicated by their Authorization to Operate, and SHOULD use automated processing and filtering of machine readable information from cloud service providers.",
              "name": "Review Vulnerability Reports",
              "note": "FedRAMP recommends that agencies only review overdue and accepted vulnerabilities with a potential adverse impact of N3 or higher unless the cloud service provider recommends mitigations or the service is included in a higher risk federal information system. Furthermore, accepted vulnerabilities generally only need to be reviewed when they are added or during an updated risk assessment due to changes in the agency’s use or authorization.",
              "affects": ["Agencies"],
              "primary_key_word": "SHOULD"
            },
            "VDR-AGM-MAP": {
              "fka": "FRR-VDR-AG-02",
              "statement": "Agencies SHOULD use vulnerability information reported by the Provider to maintain Plans of Action & Milestones for agency security programs when relevant according to agency security policies (such as if the agency takes action to mitigate the risk of exploitation or authorized the continued use of a cloud service with accepted vulnerabilities that put agency information systems at risk).",
              "name": "Maintain Agency POA&M",
              "affects": ["Agencies"],
              "primary_key_word": "SHOULD"
            },
            "VDR-AGM-DRE": {
              "fka": "FRR-VDR-AG-03",
              "statement": "Agencies SHOULD NOT request additional information from cloud service providers that is not required by this FedRAMP process UNLESS the head of the agency or an authorized delegate makes a determination that there is a demonstrable need for such.",
              "name": "Do Not Request Extra Info",
              "note": "This is related to the Presumption of Adequacy directed by 44 USC § 3613 (e).",
              "affects": ["Agencies"],
              "primary_key_word": "SHOULD NOT"
            },
            "VDR-AGM-NFR": {
              "fka": "FRR-VDR-AG-04",
              "statement": "Agencies MUST inform FedRAMP after requesting any additional vulnerability information or materials from a cloud service provider beyond those FedRAMP requires by sending a notification to [info@fedramp.gov](mailto:info@fedramp.gov).",
              "name": "Notify FedRAMP",
              "note": "This is an OMB policy; agencies are required to notify FedRAMP in OMB Memorandum M-24-15 section IV (a).",
              "affects": ["Agencies"],
              "primary_key_word": "MUST"
            }
          }
        }
      }
    }
  }
}
